espressif/openocd-esp32/src/target/esp108_apptrace.c
// 4.1 Trace Memory Blocks
// -----------------------

// Communication is controlled via special register. Host periodically polls control register on each core to find out if there are any data avalable.
// When current input memory block is filled it is exposed to host and 'block_len' and 'block_id' fields are updated in the control register.
// Host reads new register value and according to it's value starts reading data from exposed block. Meanwhile target starts filling another trace block.
// When host finishes reading the block it clears 'block_len' field in control register indicating to the target that it is ready to accept the next one.
// If the host has some data to transfer to the target it writes them to trace memory block before clearing 'block_len' field. Then it sets
// 'host_data_present' bit and clears 'block_len' field in control register. Upon every block switch target checks 'host_data_present' bit and if it is set
// reads them to down buffer before writing any trace data to switched TRAX block.

// 4.2 User Data Chunks Level
// --------------------------

// Since trace memory block is shared between user data chunks and data copying is performed on behalf of the API user (in its normal context) in
// multithreading environment it can happen that task/ISR which copies data is preempted by another high prio task/ISR. So it is possible situation
// that task/ISR will fail to complete filling its data chunk before the whole trace block is exposed to the host. To handle such conditions tracing
// module prepends all user data chunks with header which contains allocated buffer size and actual data length within it. OpenOCD command
// which reads application traces reports error when it reads incompleted user data block.
// Data which are transfered from host to target are also prepended with such header.

// 4.3 Data Buffering
// ------------------

// It takes some time for the host to read TRAX memory block via JTAG. In streaming mode it can happen that target has filled its TRAX block, but host
// has not completed reading of the previous one yet. So in this case time critical tracing calls (which can not be delayed for too long time due to
// the lack of free memory in TRAX block) can be dropped. To avoid such scenarios tracing module implements data buffering. Buffered data will be sent
// to the host later when TRAX block switch occurs. The maximum size of the buffered data is controlled by menuconfig option
// CONFIG_ESP32_APPTRACE_PENDED_DATA_SIZE_MAX.

// 4.3 Target Connection/Disconnection
// -----------------------------------

// When host is going to start tracing in streaming mode it needs to put both ESP32 cores into initial state when 'host connected' bit is set
// on both cores. To accomplish this host halts both cores and sets this bit in TRAX registers. But target code can be halted in state when it has read control
// register but has not updated its value. To handle such situations target code indicates to the host that it is updating control register by writing
// non-zero value to status register. Actually it writes address of the instruction which it will execute when it finishes with
// the registers update. When target is halted during control register update host sets breakpoint at the address from status register and resumes CPU.
// After target code finishes with register update it is halted on breakpoint, host detects it and safely sets 'host connected' bit. When both cores
// are set up they are resumed. Tracing starts without further intrusion into CPUs work.
// When host is going to stop tracing in streaming mode it needs to disconnect targets. Disconnection process is done using the same algorithm
// as for connecting, but 'host connected' bits are cleared on ESP32 cores.

// 5. Data Procesing
// =================

// Target is polled for data periodically. Period depends on tracing command arguments (see the next section). When there are data available they are copied to allocated memory block
// and that block is added to the queue for processing by a separate thread. This is done in order to achive the highest possible polling rate and not to lose data due to delays caused
// by data processing algorithm. When tracing is stopped OpenOCD waits for all pendded memory blocks to be processed by the thread.

// 6. Application Tracing Commands
// ===============================

// 6.1 Application Specific Tracing
// --------------------------------

// Command usage:

//	 esp108 apptrace [start <options>] | [stop] | [status] | [dump <cores_num> <outfile>]

// Sub-commands:

//	   * start	- Start tracing (continuous streaming).
//	   * stop	- Stop tracing.
//	   * status - Get tracing status.
//	   * dump	- Dump all data from *HW UP BUFFER* (post-mortem dump).

// Start command syntax:

//	 start <outfile1> [outfile2] [poll_period [trace_size [stop_tmo [wait4halt [skip_size]]]]

//	   * outfile1	 - Path to file to save data from PRO CPU. This argument should have the following format: `file://path/to/file`.
//	   * outfile2	 - Path to file to save data from APP CPU. This argument should have the following format: `file://path/to/file`.
//	   * poll_period - Data polling period (in ms). If greater then 0 then command runs in non-blocking mode. By default 1 ms.
//	   * trace_size	 - Maximum size of data to collect (in bytes). Tracing is stopped after specified amount of data is received. By default -1 (trace size stop trigger is disabled).
//	   * stop_tmo	 - Idle timeout (in sec). Tracing is stopped if there is no data for specified period of time. By default -1 (disable this stop trigger).
//	   * wait4halt	 - If 0 start tracing immediately, otherwise command waits for the target to be halted (after reset, by breakpoint etc.) and then automatically resumes it and starts tracing. By default 0.
//	   * skip_size	 - Number of bytes to skip at the start. By default 0.

// 6.2 SystemView Compatible Tracing
// ---------------------------------

