espressif/openocd-esp32/src/target/esp108_apptrace.c
// Command usage:

//	 esp108 sysview [start <options>] | [stop] | [status]

// Sub-commands:

//	   * start	- Start tracing (continuous streaming).
//	   * stop	- Stop tracing.
//	   * status - Get tracing status.

// Start command syntax:

//	 start <outfile1> [outfile2] [poll_period [trace_size [stop_tmo]]]

//	   * outfile1	 - Path to file to save data from PRO CPU. This argument should have the following format: `file://path/to/file`.
//	   * outfile2	 - Path to file to save data from APP CPU. This argument should have the following format: `file://path/to/file`.
//	   * poll_period - Data polling period (in ms). If greater then 0 then command runs in non-blocking mode. By default 1 ms.
//	   * trace_size	 - Maximum size of data to collect (in bytes). Tracing is stopped after specified amount of data is received. By default -1 (trace size stop trigger is disabled).
//	   * stop_tmo	 - Idle timeout (in sec). Tracing is stopped if there is no data for specified period of time. By default -1 (disable this stop trigger).

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include "target.h"
#include "time_support.h"
#include "list.h"

#include "esp108.h"
#include "esp108_dbg_regs.h"
#include "esp32.h"
#include "esp108_apptrace.h"
#include <pthread.h>

#define ESP_SYSVIEW_OPTIMIZE	1

// TRAX is disabled, so we use its registers for our own purposes
// | 31..XXXXXX..24 | 23 .(host_connect). 23 | 22 .(host_data). 22| 21..(block_id)..15 | 14..(block_len)..0 |
#define ESP_APPTRACE_TRAX_CTRL_REG			 NARADR_DELAYCNT
#define ESP_APPTRACE_TRAX_STAT_REG			 NARADR_TRIGGERPC

#define ESP_APPTRACE_BLOCK_LEN_MSK		   0x7FFFUL
#define ESP_APPTRACE_BLOCK_LEN(_l_)		   ((_l_) & ESP_APPTRACE_BLOCK_LEN_MSK)
#define ESP_APPTRACE_BLOCK_LEN_GET(_v_)	   ((_v_) & ESP_APPTRACE_BLOCK_LEN_MSK)
#define ESP_APPTRACE_BLOCK_ID_MSK		   0x7FUL
#define ESP_APPTRACE_BLOCK_ID(_id_)		   (((_id_) & ESP_APPTRACE_BLOCK_ID_MSK) << 15)
#define ESP_APPTRACE_BLOCK_ID_GET(_v_)	   (((_v_) >> 15) & ESP_APPTRACE_BLOCK_ID_MSK)
#define ESP_APPTRACE_BLOCK_ID_MAX		   ESP_APPTRACE_BLOCK_ID_MSK
#define ESP_APPTRACE_HOST_DATA			   (1 << 22)
#define ESP_APPTRACE_HOST_CONNECT		   (1 << 23)

#define ESP_APPTRACE_USER_BLOCK_CORE(_v_)	((_v_) >> 15)
#define ESP_APPTRACE_USER_BLOCK_LEN(_v_)	((_v_) & ~(1 << 15))
// in SystemView mode core ID is passed in event ID field
#define ESP_SYSVIEW_USER_BLOCK_CORE(_v_)	(0) // not used
#define ESP_SYSVIEW_USER_BLOCK_LEN(_v_)		(_v_)

#define ESP_APPTRACE_USER_BLOCK_HDR_SZ		4
#if ESP_SYSVIEW_OPTIMIZE
#define ESP_SYSVIEW_USER_BLOCK_HDR_SZ		2
#else
#define ESP_SYSVIEW_USER_BLOCK_HDR_SZ		ESP_APPTRACE_USER_BLOCK_HDR_SZ
#endif

#define ESP_APPTRACE_CMD_MODE_GEN			0
#define ESP_APPTRACE_CMD_MODE_SYSVIEW		1
#define ESP_APPTRACE_CMD_MODE_SYNC			2

#define ESP_APPTRACE_TGT_STATE_TMO			5000
#define ESP_APPTRACE_TARGETS_NUM_MAX		2
#define ESP_APPTRACE_TIME_STATS_ENABLE		1
#define ESP_APPTRACE_BLOCKS_POOL_SZ			10

#define ESP_APPTRACE_FILE_CMD_FOPEN     0x0
#define ESP_APPTRACE_FILE_CMD_FCLOSE    0x1
#define ESP_APPTRACE_FILE_CMD_FWRITE    0x2
#define ESP_APPTRACE_FILE_CMD_FREAD     0x3
#define ESP_APPTRACE_FILE_CMD_FSEEK     0x4
#define ESP_APPTRACE_FILE_CMD_FTELL     0x5
#define ESP_APPTRACE_FILE_CMD_FTELL     0x5
#define ESP_APPTRACE_FILE_CMD_STOP      0x6 // indicates that there is no files to transfer

#define ESP_GCOV_FILES_MAX_NUM     		512

// grabbed from SystemView target sources
#define	  SYSVIEW_EVTID_NOP					0  // Dummy packet.
#define	  SYSVIEW_EVTID_OVERFLOW			1
#define	  SYSVIEW_EVTID_ISR_ENTER			2
#define	  SYSVIEW_EVTID_ISR_EXIT			3
#define	  SYSVIEW_EVTID_TASK_START_EXEC		4
#define	  SYSVIEW_EVTID_TASK_STOP_EXEC		5
#define	  SYSVIEW_EVTID_TASK_START_READY	6
#define	  SYSVIEW_EVTID_TASK_STOP_READY		7
#define	  SYSVIEW_EVTID_TASK_CREATE			8
#define	  SYSVIEW_EVTID_TASK_INFO			9
#define	  SYSVIEW_EVTID_TRACE_START			10
#define	  SYSVIEW_EVTID_TRACE_STOP			11
#define	  SYSVIEW_EVTID_SYSTIME_CYCLES		12
#define	  SYSVIEW_EVTID_SYSTIME_US			13
#define	  SYSVIEW_EVTID_SYSDESC				14
#define	  SYSVIEW_EVTID_USER_START			15
#define	  SYSVIEW_EVTID_USER_STOP			16
#define	  SYSVIEW_EVTID_IDLE				17
#define	  SYSVIEW_EVTID_ISR_TO_SCHEDULER	18
#define	  SYSVIEW_EVTID_TIMER_ENTER			19
#define	  SYSVIEW_EVTID_TIMER_EXIT			20
#define	  SYSVIEW_EVTID_STACK_INFO			21
#define	  SYSVIEW_EVTID_MODULEDESC			22

#define	  SYSVIEW_EVTID_INIT				24
#define	  SYSVIEW_EVTID_NAME_RESOURCE		25
#define	  SYSVIEW_EVTID_PRINT_FORMATTED		26
#define	  SYSVIEW_EVTID_NUMMODULES			27

#define	  SYSVIEW_SYNC_LEN					10

#define	  SYSVIEW_EVENT_ID_MAX			   (200)

#define SYSVIEW_ENCODE_U32(dest, val) {										\
								   uint8_t* sv_ptr;							\
								   uint32_t sv_data;						\
								   sv_ptr = dest;							\
								   sv_data = val;							\
								   while(sv_data > 0x7F) {					\
									 *sv_ptr++ = (uint8_t)(sv_data | 0x80); \
									 sv_data >>= 7;							\
								   };										\
								   *sv_ptr++ = (uint8_t)sv_data;			\
								   dest = sv_ptr;							\
								 };

typedef enum {
  SEGGER_SYSVIEW_COMMAND_ID_START = 1,
  SEGGER_SYSVIEW_COMMAND_ID_STOP,
  SEGGER_SYSVIEW_COMMAND_ID_GET_SYSTIME,
  SEGGER_SYSVIEW_COMMAND_ID_GET_TASKLIST,
  SEGGER_SYSVIEW_COMMAND_ID_GET_SYSDESC,
  SEGGER_SYSVIEW_COMMAND_ID_GET_NUMMODULES,
  SEGGER_SYSVIEW_COMMAND_ID_GET_MODULEDESC,
  // Extended commands: Commands >= 128 have a second parameter
  SEGGER_SYSVIEW_COMMAND_ID_GET_MODULE = 128
} SEGGER_SYSVIEW_COMMAND_ID;

struct esp108_apptrace_target_state {
	int			running;
	uint32_t	block_id;
	uint32_t	data_len;
};

struct esp_apptrace_target2host_hdr {
	union {
		struct {
			uint16_t	block_sz;
			uint16_t	wr_sz;
		} gen;
		struct {
#if ESP_SYSVIEW_OPTIMIZE
			uint8_t		block_sz;
			uint8_t	wr_sz;
#else
			uint16_t	block_sz;
			uint16_t	wr_sz;
#endif
		} sys_view;
	};
};

struct esp_apptrace_host2target_msg {
	struct esp_apptrace_host2target_hdr hdr;
	uint8_t							data[32];
};

struct esp_apptrace_cmd_stats {
	uint32_t		incompl_blocks;
	uint32_t		lost_bytes;
#if ESP_APPTRACE_TIME_STATS_ENABLE
	float			min_blk_read_time;
	float			max_blk_read_time;
	float			min_blk_proc_time;
	float			max_blk_proc_time;
#endif
};

struct esp_apptrace_dest_file_data {
	int fout;
};

typedef int (*esp_apptrace_dest_write_t)(void *priv, uint8_t *data, uint32_t size);
typedef int (*esp_apptrace_dest_cleanup_t)(void *priv);

struct esp_apptrace_dest {
	void *						priv;
	esp_apptrace_dest_write_t	write;
	esp_apptrace_dest_cleanup_t	clean;
};

struct esp_apptrace_cmd_ctx;

typedef int (*esp_apptrace_process_data_t)(struct esp_apptrace_cmd_ctx *ctx, int core_id, uint8_t *data, uint32_t data_len);

