espressif/openocd-esp32/src/target/esp108_apptrace.c
struct esp_apptrace_block {
	struct hlist_node	node;
	uint8_t	*			data;
	uint32_t			data_len;
};

struct esp_apptrace_cmd_ctx {
	volatile int					running;
	int								mode;
	struct target *					esp32_target;
	struct target *					cpus[ESP_APPTRACE_TARGETS_NUM_MAX];
	int								cores_num;
	uint32_t						last_blk_id;
	pthread_mutex_t					trax_blocks_mux;
	struct hlist_head				free_trax_blocks;
	struct hlist_head				ready_trax_blocks;
	uint8_t *						trax_block_data;
	uint32_t						trax_block_sz;
	pthread_t						data_processor;
	esp_apptrace_process_data_t		process_data;
	float							stop_tmo;
	uint32_t						tot_len;
	uint32_t						raw_tot_len;
	struct esp_apptrace_cmd_stats	stats;
	struct duration					read_time;
	struct duration					idle_time;
	void *							cmd_priv;
};

struct esp_apptrace_cmd_data {
	struct esp_apptrace_dest		data_dests[ESP_APPTRACE_TARGETS_NUM_MAX];
	uint32_t						poll_period;
	uint32_t						sv_acc_time_delta;
	int								sv_last_core_id;
	int								sv_trace_running;
	uint32_t						max_len;
	uint32_t						skip_len;
	bool							wait4halt;
};

struct esp_gcov_cmd_data {
	FILE *		files[ESP_GCOV_FILES_MAX_NUM];
	uint32_t 	files_num;
	bool		wait4halt;
};

// need to check `shutdown_openocd` when poll period is less then 1 ms in order to react on CTRL+C etc.
// Actually `shutdown_openocd` is an enum type var. Non-zero value tells that shutdown is requested, for now this hasck works.
// TODO: Currently for periods less then 1ms we loop in command handler until CTRL+C is pressed.
//       Another trace data polling mechanism is necessary for small periods.
extern int shutdown_openocd;

static int esp_sysview_process_data(struct esp_apptrace_cmd_ctx *ctx, int core_id, uint8_t *data, uint32_t data_len);
static int esp_gcov_process_data(struct esp_apptrace_cmd_ctx *ctx, int core_id, uint8_t *data, uint32_t data_len);
static void *esp_apptrace_data_processor(void *arg);
static int esp_apptrace_handle_trace_block(struct esp_apptrace_cmd_ctx *ctx, struct esp_apptrace_block *block);
static int esp_apptrace_cmd_ctx_cleanup(struct esp_apptrace_cmd_ctx *cmd_ctx);
static int esp_apptrace_get_data_info(struct esp_apptrace_cmd_ctx *ctx, struct esp108_apptrace_target_state *target_state, uint32_t *fired_target_num);

/*********************************************************************
*                       ESP108 Specific Functions
**********************************************************************/

int esp108_apptrace_read_data_len(struct target *target, uint32_t *block_id, uint32_t *len)
{
	int res = 0;
	uint8_t tmp[4];

	esp108_queue_nexus_reg_read(target, ESP_APPTRACE_TRAX_CTRL_REG, tmp);
	esp108_queue_tdi_idle(target);
	res = jtag_execute_queue();
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to exec JTAG queue!");
		return res;
	}
	uint32_t val = intfromchars(tmp);
	*block_id = ESP_APPTRACE_BLOCK_ID_GET(val);
	*len = ESP_APPTRACE_BLOCK_LEN_GET(val);
	return ERROR_OK;
}

int esp108_apptrace_read_data(struct target *target, uint32_t size, uint8_t *buffer, uint32_t block_id, bool ack, struct duration *dur)
{
	int res = 0;
	uint32_t i, rd_sz = size;
    uint8_t unal_bytes[4];
	uint32_t tmp = ESP_APPTRACE_HOST_CONNECT | ESP_APPTRACE_BLOCK_ID(block_id) | ESP_APPTRACE_BLOCK_LEN(0);

	LOG_DEBUG("Read data on target (%s)", target_name(target));
    if (size & 0x3UL) {
        rd_sz = (size + 0x3UL) & ~0x3UL;
    }
	esp108_queue_nexus_reg_write(target, NARADR_TRAXADDR, (ESP32_TRACEMEM_BLOCK_SZ-rd_sz)/4);
    if (size & 0x3UL) {
        esp108_queue_nexus_reg_read(target, NARADR_TRAXDATA, unal_bytes);
    }
	for (i = size/4; i > 0; i--) {
		esp108_queue_nexus_reg_read(target, NARADR_TRAXDATA, &buffer[(i-1)*4]);
	}
	if (ack) {
		LOG_DEBUG("Ack block %d target (%s)!", block_id, target_name(target));
		esp108_queue_nexus_reg_write(target, ESP_APPTRACE_TRAX_CTRL_REG, tmp);
	}
	esp108_queue_tdi_idle(target);
	if (dur && duration_start(dur) != 0) {
		LOG_ERROR("Failed to start data read measurement!");
		return ERROR_FAIL;
	}
	res = jtag_execute_queue();
	if (dur && duration_measure(dur) != 0) {
		LOG_ERROR("Failed to stop data read measurement!");
		return ERROR_FAIL;
	}
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to exec JTAG queue!");
		return res;
	}

    if (size & 0x3UL) {
        // copy the last unaligned bytes
        memcpy(buffer + size - (size & 0x3UL), unal_bytes, size & 0x3UL);
    }

	return ERROR_OK;
}

int esp108_apptrace_write_buffs(struct target *target, uint32_t bufs_num, uint32_t buf_sz[], const uint8_t *bufs[],
                                uint32_t block_id, int ack, int data)
{
    int res = ERROR_OK;
    uint32_t tmp = ESP_APPTRACE_HOST_CONNECT | (data ? ESP_APPTRACE_HOST_DATA : 0) | ESP_APPTRACE_BLOCK_ID(block_id) | ESP_APPTRACE_BLOCK_LEN(0);
    uint32_t wr_dw = 0, total_sz = 0, cached_bytes = 0;
    union {
        uint8_t data8[4];
        uint32_t data32;
    } dword_cache;

    dword_cache.data32 = 0;
    for (uint32_t i = 0; i < bufs_num; i++) {
        total_sz += buf_sz[i];
    }
    if (total_sz & 0x3UL) {
        cached_bytes = 4 - (total_sz & 0x3UL);
        total_sz = (total_sz + 0x3UL) & ~0x3UL;
    }
    esp108_queue_nexus_reg_write(target, NARADR_TRAXADDR, (ESP32_TRACEMEM_BLOCK_SZ-total_sz)/4);
    for (uint32_t i = bufs_num; i > 0; i--) {
        uint32_t bs = buf_sz[i-1];
        const uint8_t *cur_buf = bufs[i-1];
        // if there are cached bytes from the previous buffer, combine them with the last from the current buffer
        if (cached_bytes) {
            memcpy(dword_cache.data8, &cur_buf[bs - (4 - cached_bytes)], 4 - cached_bytes);
            esp108_queue_nexus_reg_write(target, NARADR_TRAXDATA, dword_cache.data32);
            bs -= 4 - cached_bytes;
            cached_bytes = 0;
            wr_dw++;
        }
        // write full dwords
        for (uint32_t k = bs; k >= 4; k -= 4) {
            uint32_t dword;
            memcpy(&dword, &cur_buf[k-4], sizeof(dword));
            esp108_queue_nexus_reg_write(target, NARADR_TRAXDATA, dword);
            wr_dw++;
        }
        // if there are bytes to be cached
        if (bs & 0x3UL) {
            cached_bytes = bs & 0x3UL;
            memcpy(&dword_cache.data8[4-cached_bytes], cur_buf, cached_bytes);
        }
    }
    if (ack) {
        LOG_DEBUG("Ack block %d on target (%s)!", block_id, target_name(target));
        esp108_queue_nexus_reg_write(target, ESP_APPTRACE_TRAX_CTRL_REG, tmp);
    }
    esp108_queue_tdi_idle(target);
    res = jtag_execute_queue();
    if (res != ERROR_OK) {
        LOG_ERROR("Failed to exec JTAG queue!");
        return res;
    }

    return ERROR_OK;
}

int esp108_apptrace_write_ctrl_reg(struct target *target, uint32_t block_id, uint32_t len, bool conn, bool data)
{
	int res = ERROR_OK;
	uint32_t tmp = (conn ? ESP_APPTRACE_HOST_CONNECT : 0) | (data ? ESP_APPTRACE_HOST_DATA : 0) | ESP_APPTRACE_BLOCK_ID(block_id) | ESP_APPTRACE_BLOCK_LEN(len);

