espressif/openocd-esp32/src/target/esp108_apptrace.c
	esp108_queue_nexus_reg_write(target, ESP_APPTRACE_TRAX_CTRL_REG, tmp);
	esp108_queue_tdi_idle(target);
	res = jtag_execute_queue();
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to exec JTAG queue!");
		return res;
	}

	return ERROR_OK;
}

int esp108_apptrace_read_status(struct target *target, uint32_t *stat)
{
	int res = 0;
	uint8_t tmp[4];

	esp108_queue_nexus_reg_read(target, ESP_APPTRACE_TRAX_STAT_REG, tmp);
	esp108_queue_tdi_idle(target);
	res = jtag_execute_queue();
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to exec JTAG queue!");
		return res;
	}
	*stat = intfromchars(tmp);
	return ERROR_OK;
}

int esp108_apptrace_write_status(struct target *target, uint32_t stat)
{
	int res = 0;

	esp108_queue_nexus_reg_write(target, ESP_APPTRACE_TRAX_STAT_REG, stat);
	esp108_queue_tdi_idle(target);
	res = jtag_execute_queue();
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to exec JTAG queue!");
		return res;
	}
	return ERROR_OK;
}

static int esp108_activate_swdbg(struct target *target, int enab)
{
	int res;

	esp108_queue_nexus_reg_write(target, enab ? NARADR_DCRSET : NARADR_DCRCLR, OCDDCR_DEBUGSWACTIVE);
	esp108_queue_tdi_idle(target);
	res=jtag_execute_queue();
	if (res!=ERROR_OK) {
		LOG_ERROR("%s: writing DCR failed!", target->cmd_name);
		return ERROR_FAIL;
	}

	return ERROR_OK;
}

/*********************************************************************
*                       ESP32/108 Common Functions
**********************************************************************/

static int esp_apptrace_file_dest_write(void *priv, uint8_t *data, uint32_t size)
{
	struct esp_apptrace_dest_file_data *dest_data = (struct esp_apptrace_dest_file_data *)priv;

	if (write(dest_data->fout, data, size) != (ssize_t)size) {
		LOG_ERROR("Failed to write %u bytes to out file!", size);
		return ERROR_FAIL;
	}
	return ERROR_OK;
}

static int esp_apptrace_file_dest_cleanup(void *priv)
{
	struct esp_apptrace_dest_file_data *dest_data = (struct esp_apptrace_dest_file_data *)priv;

	if (dest_data->fout > 0) {
		close(dest_data->fout);
	}
	free(dest_data);
	return ERROR_OK;
}

static int esp_apptrace_file_dest_init(struct esp_apptrace_dest *dest, const char *dest_name)
{
	struct esp_apptrace_dest_file_data *dest_data = malloc(sizeof(struct esp_apptrace_dest_file_data));
	if (!dest_data) {
		LOG_ERROR("Failed to alloc mem for file dest!");
		return ERROR_FAIL;
	}
	memset(dest_data, 0, sizeof(struct esp_apptrace_dest_file_data));

	LOG_INFO("Open file %s", dest_name);
	dest_data->fout = open(dest_name, O_WRONLY|O_CREAT|O_TRUNC|O_BINARY, 0666);
	if (dest_data->fout <= 0) {
		LOG_ERROR("Failed to open file %s", dest_name);
		return ERROR_FAIL;
	}

	dest->priv = dest_data;
	dest->write = esp_apptrace_file_dest_write;
	dest->clean = esp_apptrace_file_dest_cleanup;

	return ERROR_OK;
}

static int esp_apptrace_dest_init(struct esp_apptrace_dest dest[], const char *dest_paths[], int max_dests)
{
	int res = ERROR_OK, i;

	for (i = 0; i < max_dests; i++) {
		if (strncmp(dest_paths[i], "file://", 7) == 0) {
			res = esp_apptrace_file_dest_init(&dest[i], &dest_paths[i][7]);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to init destination '%s'!", dest_paths[i]);
				return 0;
			}
		}
		else {
			break;
		}
	}

	return i;
}

static int esp_apptrace_dest_cleanup(struct esp_apptrace_dest dest[], int max_dests)
{
	for (int i = 0; i < max_dests; i++) {
		if (dest[i].clean) {
			return dest[i].clean(dest[i].priv);
		}
	}
	return ERROR_OK;
}

static void esp_apptrace_blocks_pool_cleanup(struct esp_apptrace_cmd_ctx *ctx)
{
	struct esp_apptrace_block *cur;
	struct hlist_node *pos, *tmp;
	hlist_for_each_entry_safe(cur, pos, tmp, &ctx->free_trax_blocks, node) {
		if (cur) {
			hlist_del(&cur->node);
			if (cur->data) {
				free(cur->data);
			}
			free(cur);
		}
	}
	hlist_for_each_entry_safe(cur, pos, tmp, &ctx->ready_trax_blocks, node) {
		if (cur) {
			hlist_del(&cur->node);
			if (cur->data) {
				free(cur->data);
			}
			free(cur);
		}
	}
}

static struct esp_apptrace_block *esp_apptrace_free_block_get(struct esp_apptrace_cmd_ctx *ctx)
{
	struct esp_apptrace_block *block = NULL;

	int res = pthread_mutex_lock(&ctx->trax_blocks_mux);
	if (res == 0) {
		if (!hlist_empty(&ctx->free_trax_blocks)) {
			//get first
			block = hlist_entry(ctx->free_trax_blocks.first, struct esp_apptrace_block, node);
			hlist_del(&block->node);
		}
		res = pthread_mutex_unlock(&ctx->trax_blocks_mux);
		if (res) {
			LOG_ERROR("Failed to unlock blocks pool (%d)!", res);
		}
	}

	return block;
}

static int esp_apptrace_ready_block_put(struct esp_apptrace_cmd_ctx *ctx, struct esp_apptrace_block *block)
{
	int res;

	res = pthread_mutex_lock(&ctx->trax_blocks_mux);
	if (res == 0) {
		// add to ready blocks list
		INIT_HLIST_NODE(&block->node);
		hlist_add_head(&block->node, &ctx->ready_trax_blocks);
		res = pthread_mutex_unlock(&ctx->trax_blocks_mux);
		if (res) {
			LOG_ERROR("Failed to unlock blocks pool (%d)!", res);
			res = ERROR_FAIL;
		}
		res = ERROR_OK;
	}
	else {
		LOG_ERROR("Failed to lock blocks pool (%d)!", res);
		res = ERROR_FAIL;
	}

	return res;
}

static struct esp_apptrace_block *esp_apptrace_ready_block_get(struct esp_apptrace_cmd_ctx *ctx)
{
	struct esp_apptrace_block *block = NULL;

	if (pthread_mutex_trylock(&ctx->trax_blocks_mux) == 0) {
		if (!hlist_empty(&ctx->ready_trax_blocks)) {
			struct hlist_node *tmp;
			// find to the last
			hlist_for_each_entry(block, tmp, &ctx->ready_trax_blocks, node);
			// remove it from ready list
			hlist_del(&block->node);
		}
		int res = pthread_mutex_unlock(&ctx->trax_blocks_mux);
		if (res) {
			LOG_ERROR("Failed to unlock blocks pool (%d)!", res);
		}
	}

	return block;
}

static int esp_apptrace_block_free(struct esp_apptrace_cmd_ctx *ctx, struct esp_apptrace_block *block)
{
	int res;

	res = pthread_mutex_lock(&ctx->trax_blocks_mux);
	if (res == 0) {
		// add to free blocks list
		INIT_HLIST_NODE(&block->node);
		hlist_add_head(&block->node, &ctx->free_trax_blocks);
		res = pthread_mutex_unlock(&ctx->trax_blocks_mux);
		if (res) {
			LOG_ERROR("Failed to unlock blocks pool (%d)!", res);
			res = ERROR_FAIL;
		}
		res = ERROR_OK;
	}
	else {
		LOG_ERROR("Failed to lock blocks pool (%d)!", res);
		res = ERROR_FAIL;
	}

	return res;
}

