espressif/openocd-esp32/src/target/esp108_apptrace.c
static int esp_apptrace_wait_pended_blocks(struct esp_apptrace_cmd_ctx *ctx)
{
	int i = 0;
	while (!hlist_empty(&ctx->ready_trax_blocks)) {
		alive_sleep(100);
		if (i++ == 50) {
			return ERROR_FAIL;
		}
	}

	return ERROR_OK;
}

static int esp_apptrace_cmd_ctx_init(struct target *target, struct esp_apptrace_cmd_ctx *cmd_ctx, int mode)
{
	uint8_t traxstat[4], memadrstart[4], memadrend[4], adr[4], traxctl[4];
	int res;

	memset(cmd_ctx, 0, sizeof(struct esp_apptrace_cmd_ctx));

	cmd_ctx->data_processor = (pthread_t)-1;
	cmd_ctx->stop_tmo = -1.0; // infinite
	cmd_ctx->mode = mode;
	if (strcmp(target->type->name, "esp32") == 0) {
		struct esp32_common *esp32 = (struct esp32_common*)target->arch_info;
		// HACK: OOCD has no attach event for telnet session so
		// halt and resume target if numbers of working cores has not been detected yet,
		// e.g. when we connected via telnet to running target
		if (esp32->cores_num == 0 && target->state == TARGET_RUNNING) {
			res = target_halt(target);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to halt target (%d)!", res);
				return res;
			}
			res = target_wait_state(target, TARGET_HALTED, ESP_APPTRACE_TGT_STATE_TMO);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to halt target (%d)!", res);
				return res;
			}
			res = target_resume(target, 1, 0, 1, 0);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to halt target (%d)!", res);
				return res;
			}
		}
		cmd_ctx->esp32_target = target;
		cmd_ctx->cores_num = target_get_core_count(target);
	} else {
		cmd_ctx->esp32_target = NULL;
		// TODO: add support for esp108 targets in single core mode
		// FIXME: Do we actually need it?
		cmd_ctx->cores_num = 2;
	}

	for (int i = 0; i < cmd_ctx->cores_num; i++) {
		if (cmd_ctx->esp32_target) {
			struct esp32_common *esp32 = (struct esp32_common *)target->arch_info;
			cmd_ctx->cpus[i] = esp32->esp32_targets[i];
		} else {
			cmd_ctx->cpus[i] = get_target_by_num(i);
		}
		if (!cmd_ctx->cpus[i]) {
			LOG_ERROR("Failed to get CPU%d target!", i);
			return ERROR_FAIL;
		}
	}

	esp108_queue_nexus_reg_read(cmd_ctx->cpus[0], NARADR_TRAXSTAT, traxstat);
	esp108_queue_nexus_reg_read(cmd_ctx->cpus[0], NARADR_TRAXCTRL, traxctl);
	esp108_queue_nexus_reg_read(cmd_ctx->cpus[0], NARADR_MEMADDRSTART, memadrstart);
	esp108_queue_nexus_reg_read(cmd_ctx->cpus[0], NARADR_MEMADDREND, memadrend);
	esp108_queue_nexus_reg_read(cmd_ctx->cpus[0], NARADR_TRAXADDR, adr);
	esp108_queue_tdi_idle(cmd_ctx->cpus[0]);
	res = jtag_execute_queue();
	if (res) {
		LOG_ERROR("Failed to read TRAX config (%d)!", res);
		return res;
	}

	cmd_ctx->trax_block_sz = 1 << (((intfromchars(traxstat) >> 8) & 0x1f) - 2);
	cmd_ctx->trax_block_sz *= 4;
	LOG_DEBUG("stat=%0x ctrl=%0x", intfromchars(traxstat), intfromchars(traxctl));
	LOG_DEBUG("memadrstart=%x memadrend=%x traxadr=%x memsz=%x", intfromchars(memadrstart), intfromchars(memadrend), intfromchars(adr), cmd_ctx->trax_block_sz);
	LOG_INFO("Total trace memory: %d bytes", cmd_ctx->trax_block_sz);

	INIT_HLIST_HEAD(&cmd_ctx->ready_trax_blocks);
	INIT_HLIST_HEAD(&cmd_ctx->free_trax_blocks);
	for (int i = 0; i < ESP_APPTRACE_BLOCKS_POOL_SZ; i++) {
		struct esp_apptrace_block *block = malloc(sizeof(struct esp_apptrace_block));
		if (!block) {
			LOG_ERROR("Failed to alloc trace buffer entry!");
			esp_apptrace_blocks_pool_cleanup(cmd_ctx);
			return ERROR_FAIL;
		}
		block->data = malloc(cmd_ctx->trax_block_sz);
		if (!block->data) {
			free(block);
			LOG_ERROR("Failed to alloc trace buffer %d bytes!", cmd_ctx->trax_block_sz);
			esp_apptrace_blocks_pool_cleanup(cmd_ctx);
			return ERROR_FAIL;
		}
		INIT_HLIST_NODE(&block->node);
		hlist_add_head(&block->node, &cmd_ctx->free_trax_blocks);
	}

	cmd_ctx->running = 1;

	res = pthread_mutex_init(&cmd_ctx->trax_blocks_mux, NULL);
	if (res) {
		LOG_ERROR("Failed to blocks pool mux (%d)!", res);
		esp_apptrace_blocks_pool_cleanup(cmd_ctx);
		return ERROR_FAIL;
	}
	if (cmd_ctx->mode != ESP_APPTRACE_CMD_MODE_SYNC) {
		res = pthread_create(&cmd_ctx->data_processor, NULL, esp_apptrace_data_processor, cmd_ctx);
		if (res) {
			LOG_ERROR("Failed to start trace data processor thread (%d)!", res);
			cmd_ctx->data_processor = (pthread_t)-1;
			pthread_mutex_destroy(&cmd_ctx->trax_blocks_mux);
			esp_apptrace_blocks_pool_cleanup(cmd_ctx);
			return ERROR_FAIL;
		}
	}

#if ESP_APPTRACE_TIME_STATS_ENABLE
	cmd_ctx->stats.min_blk_read_time = 1000000.0;
	cmd_ctx->stats.min_blk_proc_time = 1000000.0;
#endif
	if (duration_start(&cmd_ctx->idle_time) != 0) {
		LOG_ERROR("Failed to start idle time measurement!");
		esp_apptrace_cmd_ctx_cleanup(cmd_ctx);
		return ERROR_FAIL;
	}

	return ERROR_OK;
}

static int esp_apptrace_cmd_ctx_cleanup(struct esp_apptrace_cmd_ctx *cmd_ctx)
{
	if (cmd_ctx->data_processor != (pthread_t)-1) {
		void *thr_res;
		int res = pthread_join(cmd_ctx->data_processor, (void *)&thr_res);
		if (res) {
			LOG_ERROR("Failed to join trace data processor thread (%d)!", res);
		}
		else {
			LOG_INFO("Trace data processor thread exited with %ld", (long)thr_res);
		}
	}
	pthread_mutex_destroy(&cmd_ctx->trax_blocks_mux);
	esp_apptrace_blocks_pool_cleanup(cmd_ctx);
	return ERROR_OK;
}

#define ESP_APPTRACE_CMD_NUM_ARG_CHECK(_arg_, _start_, _end_)    \
    do { \
        if ((_arg_) == 0 && (_start_) == (_end_)) { \
            LOG_ERROR("Invalid '" #_arg_ "' arg!"); \
            res = ERROR_FAIL; \
            goto on_error; \
        } \
    } while (0)

static int esp_apptrace_cmd_init(struct target *target, struct esp_apptrace_cmd_ctx *cmd_ctx, int mode, const char **argv, int argc)
{
	int res;

	if (argc < 1) {
		LOG_ERROR("Not enough args! Need trace data destination!");
		return ERROR_FAIL;
	}

	res = esp_apptrace_cmd_ctx_init(target, cmd_ctx, mode);
	if (res) {
		return res;
	}
	if (cmd_ctx->mode == ESP_APPTRACE_CMD_MODE_SYSVIEW && argc < cmd_ctx->cores_num) {
		LOG_ERROR("Not enough args! Need %d trace data destinations!", cmd_ctx->cores_num);
		cmd_ctx->running = 0;
		esp_apptrace_cmd_ctx_cleanup(cmd_ctx);
		return ERROR_FAIL;
	}
	struct esp_apptrace_cmd_data *cmd_data = malloc(sizeof(struct esp_apptrace_cmd_data));
	if (!cmd_data) {
		LOG_ERROR("Failed to alloc cmd data!");
		cmd_ctx->running = 0;
		esp_apptrace_cmd_ctx_cleanup(cmd_ctx);
		return ERROR_FAIL;
	}
	memset(cmd_data, 0, sizeof(struct esp_apptrace_cmd_data));
	cmd_ctx->cmd_priv = cmd_data;

	//outfile1 [outfile2] [poll_period [trace_size [stop_tmo [wait4halt [skip_size]]]]]
	cmd_data->max_len = (uint32_t)-1;
	cmd_data->poll_period = 1/*ms*/;
	int dests_num = esp_apptrace_dest_init(cmd_data->data_dests, argv, cmd_ctx->mode == ESP_APPTRACE_CMD_MODE_SYSVIEW ? cmd_ctx->cores_num : 1);
	if (cmd_ctx->mode == ESP_APPTRACE_CMD_MODE_SYSVIEW && dests_num < cmd_ctx->cores_num) {
		LOG_ERROR("Not enough args! Need %d trace data destinations!", cmd_ctx->cores_num);
		res = ERROR_FAIL;
        goto on_error;
	}
	if (argc > dests_num) {
        char *end;
		cmd_data->poll_period = strtoul(argv[dests_num+0], &end, 10);
        ESP_APPTRACE_CMD_NUM_ARG_CHECK(cmd_data->poll_period, argv[dests_num+0], end);
		if (argc > dests_num+1) {
			cmd_data->max_len = strtoul(argv[dests_num+1], &end, 10);
            ESP_APPTRACE_CMD_NUM_ARG_CHECK(cmd_data->max_len, argv[dests_num+1], end);
			if (argc > dests_num+2) {
				int32_t tmo = strtol(argv[dests_num+2], &end, 10);
                ESP_APPTRACE_CMD_NUM_ARG_CHECK(tmo, argv[dests_num+2], end);
				cmd_ctx->stop_tmo = 1.0*tmo;
				if (argc > dests_num+3) {
					cmd_data->wait4halt = strtoul(argv[dests_num+3], &end, 10);
                    ESP_APPTRACE_CMD_NUM_ARG_CHECK(cmd_data->wait4halt, argv[dests_num+3], end);
					if (argc > dests_num+4) {
						cmd_data->skip_len = strtoul(argv[dests_num+4], &end, 10);
                        ESP_APPTRACE_CMD_NUM_ARG_CHECK(cmd_data->skip_len, argv[dests_num+4], end);
					}
				}
			}
		}
	}
	LOG_USER("App trace params: from %d cores, size %u bytes, stop_tmo %g s, poll period %u ms, wait_rst %d, skip %u bytes",
			cmd_ctx->cores_num, cmd_data->max_len, cmd_ctx->stop_tmo, cmd_data->poll_period, cmd_data->wait4halt, cmd_data->skip_len);

	return ERROR_OK;
on_error:
    LOG_ERROR("Not enough args! Need %d trace data destinations!", cmd_ctx->cores_num);
    free(cmd_data);
    cmd_ctx->running = 0;
    esp_apptrace_cmd_ctx_cleanup(cmd_ctx);
    return res;
}

static int esp_apptrace_cmd_cleanup(struct esp_apptrace_cmd_ctx *cmd_ctx)
{
	struct esp_apptrace_cmd_data *cmd_data = cmd_ctx->cmd_priv;

