espressif/openocd-esp32/src/target/esp108_apptrace.c
	esp_apptrace_dest_cleanup(cmd_data->data_dests, cmd_ctx->cores_num);
	free(cmd_data);
	esp_apptrace_cmd_ctx_cleanup(cmd_ctx);
	memset(cmd_ctx, 0, sizeof(*cmd_ctx));
	return ERROR_OK;
}

static void esp_apptrace_print_stats(struct esp_apptrace_cmd_ctx *ctx)
{
	struct esp_apptrace_cmd_data *cmd_data = ctx->cmd_priv;

	LOG_USER("Tracing is %s. Size is %u of %u @ %f (%f) KB/s", !ctx->running ? "STOPPED" : "RUNNING",
			ctx->tot_len > cmd_data->skip_len ? ctx->tot_len - cmd_data->skip_len : 0,
			cmd_data->max_len, duration_kbps(&ctx->read_time, ctx->tot_len),
			duration_kbps(&ctx->read_time, ctx->raw_tot_len));
	LOG_USER("Data: blocks incomplete %u, lost bytes: %u", ctx->stats.incompl_blocks, ctx->stats.lost_bytes);
#if ESP_APPTRACE_TIME_STATS_ENABLE
	LOG_USER("TRAX: block read time [%f..%f] ms", 1000*ctx->stats.min_blk_read_time, 1000*ctx->stats.max_blk_read_time);
	LOG_USER("TRAX: block proc time [%f..%f] ms", 1000*ctx->stats.min_blk_proc_time, 1000*ctx->stats.max_blk_proc_time);
#endif
}

static int esp_apptrace_wait4halt(struct esp_apptrace_cmd_ctx *ctx)
{
	int halted = 0;

	LOG_USER("Wait for halt...");
	while (!shutdown_openocd) {
	 	if (ctx->esp32_target) {
			int res = target_poll(ctx->esp32_target);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to poll target (%d)!", res);
				return res;
			}
			if (ctx->esp32_target->state == TARGET_HALTED) {
				LOG_USER("%s: HALTED", ctx->esp32_target->cmd_name);
				break;
			}
	 	} else {
			for (int k = 0; k < ctx->cores_num; k++) {
				int res = target_poll(ctx->cpus[k]);
				if (res != ERROR_OK) {
					LOG_ERROR("Failed to poll target%d (%d)!", k, res);
					return res;
				}
				if (ctx->cpus[k]->state == TARGET_HALTED) {
					LOG_USER("%s: HALTED", ctx->cpus[k]->cmd_name);
					if (++halted == ctx->cores_num)
						break;
				}
			}
	 	}
		if(halted)
			break;
		alive_sleep(500);
	}
	return ERROR_OK;
}

static int esp_apptrace_safe_halt_targets(struct esp_apptrace_cmd_ctx *ctx, struct esp108_apptrace_target_state *targets)
{
	int res = ERROR_OK;

	memset(targets, 0, ctx->cores_num*sizeof(struct esp108_apptrace_target_state));
	// halt all CPUs
	LOG_DEBUG("Halt all targets!");
 	if (ctx->esp32_target) {
 		if (ctx->esp32_target->state != TARGET_HALTED) {
			res = target_halt(ctx->esp32_target);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to halt target (%d)!", res);
				return res;
			}
			res = target_wait_state(ctx->esp32_target, TARGET_HALTED, ESP_APPTRACE_TGT_STATE_TMO);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to wait halt target %s / %d (%d)!", target_name(ctx->esp32_target), ctx->esp32_target->state, res);
				return res;
			}
		}
 	} else {
		for (int k = 0; k < ctx->cores_num; k++) {
	 		if (ctx->cpus[k]->state == TARGET_HALTED) {
			 	targets[k].running = 0;
	 			continue;
	 		}
		 	targets[k].running = 1;
			res = target_halt(ctx->cpus[k]);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to halt target%d (%d)!", k, res);
				return res;
			}
			res = target_wait_state(ctx->cpus[k], TARGET_HALTED, ESP_APPTRACE_TGT_STATE_TMO);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to wait halt target %s / %d (%d)!", target_name(ctx->cpus[k]), ctx->cpus[k]->state, res);
				return res;
			}
		}
 	}
	// read current block statuses from CPUs
	LOG_DEBUG("Read current block statuses");
	for (int k = 0; k < ctx->cores_num; k++) {
		uint32_t stat;
		res = esp108_apptrace_read_status(ctx->cpus[k], &stat);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to read trace status (%d)!", res);
			return res;
		}
		// check if some CPU stopped inside TRAX reg update critical section
		if (stat) {
			res = esp108_activate_swdbg(ctx->cpus[k], 1/*enable*/);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to activate SW debug (%d)!", res);
				return res;
			}
			uint32_t bp_addr = stat;
			res = breakpoint_add(ctx->esp32_target ? ctx->esp32_target : ctx->cpus[k], bp_addr, 1, BKPT_HARD);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to set breakpoint (%d)!", res);
				return res;
			}
			while (stat) {
				// allow this CPU to leave ERI write critical section
				res = target_resume(ctx->esp32_target ? ctx->esp32_target : ctx->cpus[k], 1, 0, 1, 0);
				if (res != ERROR_OK) {
					LOG_ERROR("Failed to resume target (%d)!", res);
					breakpoint_remove(ctx->esp32_target ? ctx->esp32_target : ctx->cpus[k], bp_addr);
					return res;
				}
				// wait for CPU to be halted on BP
				enum target_debug_reason debug_reason = DBG_REASON_UNDEFINED;
				while (debug_reason != DBG_REASON_BREAKPOINT) {
					res = target_wait_state(ctx->esp32_target ? ctx->esp32_target : ctx->cpus[k], TARGET_HALTED, ESP_APPTRACE_TGT_STATE_TMO);
					if (res != ERROR_OK) {
						LOG_ERROR("Failed to wait halt on bp target (%d)!", res);
						breakpoint_remove(ctx->esp32_target ? ctx->esp32_target : ctx->cpus[k], bp_addr);
						return res;
					}
					debug_reason = ctx->esp32_target ? ctx->esp32_target->debug_reason : ctx->cpus[k]->debug_reason;
				}
				res = esp108_apptrace_read_status(ctx->cpus[k], &stat);
				if (res != ERROR_OK) {
					LOG_ERROR("Failed to read trace status (%d)!", res);
					breakpoint_remove(ctx->esp32_target ? ctx->esp32_target : ctx->cpus[k], bp_addr);
					return res;
				}
			}
			breakpoint_remove(ctx->esp32_target ? ctx->esp32_target : ctx->cpus[k], bp_addr);
			res = esp108_activate_swdbg(ctx->cpus[k], 0/*disable*/);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to de-activate SW debug (%d)!", res);
				return res;
			}
		}
		res = esp108_apptrace_read_data_len(ctx->cpus[k], &targets[k].block_id, &targets[k].data_len);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to read trace status (%d)!", res);
			return res;
		}
	}

	return ERROR_OK;
}

static int esp_apptrace_connect_targets(struct esp_apptrace_cmd_ctx *ctx, bool conn, bool resume_target)
{
	int res = ERROR_OK;
	struct esp108_apptrace_target_state target_to_connect[ESP_APPTRACE_TARGETS_NUM_MAX];

	if (conn)
		LOG_USER("Connect targets...");
	else
		LOG_USER("Disconnect targets...");

	res = esp_apptrace_safe_halt_targets(ctx, target_to_connect);
    if (res != ERROR_OK) {
    	LOG_ERROR("Failed to halt targets (%d)!", res);
    	return res;
    }
	if (ctx->cores_num > 1) {
		// set block ids to the highest value
		if (target_to_connect[0].block_id != target_to_connect[1].block_id) {
			if (target_to_connect[1].block_id > target_to_connect[0].block_id)
				target_to_connect[0].block_id = target_to_connect[1].block_id;
			else
				target_to_connect[1].block_id = target_to_connect[0].block_id;
		}
	}
	for (int k = 0; k < ctx->cores_num; k++) {
		// update host connected status
		res = esp108_apptrace_write_ctrl_reg(ctx->cpus[k], target_to_connect[k].block_id,
											0/*ack target data*/, conn, 0/*no host data*/);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to read trace status (%d)!", res);
			return res;
		}
        if (resume_target && !ctx->esp32_target) {
            res = target_resume(ctx->cpus[k], 1, 0, 1, 0);
            if (res != ERROR_OK) {
                LOG_ERROR("Failed to resume target %d (%d)!", k, res);
                return res;
            }
        }
	}
    if (resume_target && ctx->esp32_target) {
        LOG_DEBUG("Resume targets");
        res = target_resume(ctx->esp32_target, 1, 0, 1, 0);
        if (res != ERROR_OK) {
            LOG_ERROR("Failed to resume target (%d)!", res);
            return res;
        }
    }
    if (conn)
		LOG_INFO("Targets connected.");
	else
		LOG_INFO("Targets disconnected.");
	return res;
}

