espressif/openocd-esp32/src/target/esp108_apptrace.c
static int esp_sysview_queue_cmds(struct target *target, uint8_t *cmds, uint32_t cmds_num, uint32_t block_id)
{
	struct esp_apptrace_host2target_msg msg;

	msg.hdr.block_sz = 0;
	for (uint32_t i = 0; i < cmds_num; i++) {
		msg.hdr.block_sz++;
		msg.data[i] = cmds[i];
		LOG_DEBUG("SEGGER: Send command %d, b %d", cmds[i], msg.hdr.block_sz);
	}
	// write header with or without data
	int res = esp108_apptrace_usr_block_write(target, block_id, (uint8_t *)&msg, sizeof(struct esp_apptrace_host2target_hdr) + msg.hdr.block_sz);
	if (res != ERROR_OK) {
		LOG_ERROR("SEGGER: Failed to write data to (%s)!", target_name(target));
		return res;
	}
	return res;
}

static int esp_sysview_write_trace_header(struct esp_apptrace_cmd_ctx *ctx)
{
	struct esp_apptrace_cmd_data *cmd_data = ctx->cmd_priv;

	char hdr_str[] = ";\n"
					 "; Version		SEGGER SystemViewer V2.42\n"
					 "; Author		Espressif Inc\n"
					 ";\n";
	int hdr_len = strlen(hdr_str);
	for (int i = 0; i < ctx->cores_num; i++) {
		int res = cmd_data->data_dests[i].write(cmd_data->data_dests[i].priv, (uint8_t *)hdr_str, hdr_len);
		if (res != ERROR_OK) {
			LOG_ERROR("SEGGER: Failed to write %u bytes to dest %d!", hdr_len, i);
			return ERROR_FAIL;
		}
	}
	return ERROR_OK;
}

// this function must be called after connecting to targets
static int esp_sysview_start(struct esp_apptrace_cmd_ctx *ctx)
{
	uint8_t cmds[] = {SEGGER_SYSVIEW_COMMAND_ID_START};
	uint32_t fired_target_num = 0;
	struct esp108_apptrace_target_state target_state[ESP_APPTRACE_TARGETS_NUM_MAX];
	struct esp_apptrace_cmd_data *cmd_data =(struct esp_apptrace_cmd_data *)ctx->cmd_priv;

	// get current block id
	int res = esp_apptrace_get_data_info(ctx, target_state, &fired_target_num);
	if (res != ERROR_OK) {
		LOG_ERROR("SEGGER: Failed to read target data info!");
		return res;
	}
	if (fired_target_num == (uint32_t)-1) {
		// it can happen that there is no pending target data, but block was switched
		// in this case block_ids on both CPUs are equal, so select the first one
		fired_target_num = 0;
	}
	// start tracing
	res = esp_sysview_queue_cmds(ctx->cpus[fired_target_num], cmds, sizeof(cmds)/sizeof(cmds[0]),
										target_state[fired_target_num].block_id);
	if (res != ERROR_OK) {
		LOG_ERROR("SEGGER: Failed to start tracing!");
		return res;
	}
	cmd_data->sv_trace_running = 1;
	return res;
}

static int esp_sysview_stop(struct esp_apptrace_cmd_ctx *ctx)
{
	uint32_t old_block_id, fired_target_num = 0, empty_target_num = 0;
	struct esp108_apptrace_target_state target_state[ESP_APPTRACE_TARGETS_NUM_MAX];
	struct esp_apptrace_cmd_data *cmd_data =(struct esp_apptrace_cmd_data *)ctx->cmd_priv;
	uint8_t cmds[] = {SEGGER_SYSVIEW_COMMAND_ID_STOP};
	struct duration wait_time;

	struct esp_apptrace_block *block = esp_apptrace_free_block_get(ctx);
	if (!block) {
		LOG_ERROR("Failed to get free block for data on (%s)!", target_name(ctx->cpus[fired_target_num]));
		return ERROR_FAIL;
	}

	// halt all CPUs, otherwise it can happen that there is no target data and
	// while we are queueing commands on one CPU another CPU switches TRAX block
	int res = esp_apptrace_safe_halt_targets(ctx, target_state);
	if (res != ERROR_OK) {
		LOG_ERROR("SEGGER: Failed to halt targets (%d)!", res);
		return res;
	}
	// it can happen that there is no pending target data
	// in this case block_ids on both CPUs are equal, so the first one will be selected
	for (int k = 0; k < ctx->cores_num; k++) {
		if (target_state[k].data_len) {
			fired_target_num = k;
			break;
		}
	}
	if (target_state[fired_target_num].data_len) {
		// read pending data without ack, they will be acked when stop command is queued
		res = esp108_apptrace_read_data(ctx->cpus[fired_target_num], target_state[fired_target_num].data_len,
										block->data, target_state[fired_target_num].block_id,
										0/*no ack target data*/, NULL);
		if (res != ERROR_OK) {
			LOG_ERROR("SEGGER: Failed to read data on (%s)!", target_name(ctx->cpus[fired_target_num]));
			return res;
		} else {
			// process data
			block->data_len = target_state[fired_target_num].data_len;
			res = esp_apptrace_handle_trace_block(ctx, block);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to process trace block %d bytes!", block->data_len);
				return res;
			}
		}
	}
	// stop tracing and ack target data
	res = esp_sysview_queue_cmds(ctx->cpus[fired_target_num], cmds, sizeof(cmds)/sizeof(cmds[0]), target_state[fired_target_num].block_id);
	if (res != ERROR_OK) {
		LOG_ERROR("SEGGER: Failed to stop tracing!");
		return res;
	}
	if (ctx->cores_num > 1) {
		empty_target_num = fired_target_num ? 0 : 1;
		// ack target data on another CPU
		res = esp108_apptrace_write_ctrl_reg(ctx->cpus[empty_target_num], target_state[fired_target_num].block_id,
											0/*target data ack*/, 1/*host connected*/, 0 /*no host data*/);
		if (res != ERROR_OK) {
			LOG_ERROR("SEGGER: Failed to ack data on target '%s' (%d)!", target_name(ctx->cpus[empty_target_num]), res);
			return res;
		}
	}
	// resume targets to allow command processing
	LOG_INFO("Resume targets");
	if (ctx->esp32_target) {
		res = target_resume(ctx->esp32_target, 1, 0, 1, 0);
		if (res != ERROR_OK) {
			LOG_ERROR("SEGGER: Failed to resume target '%s' (%d)!", target_name(ctx->esp32_target), res);
			return res;
		}
	} else {
		for (int k = 0; k < ctx->cores_num; k++) {
			res = target_resume(ctx->cpus[k], 1, 0, 1, 0);
			if (res != ERROR_OK) {
				LOG_ERROR("SEGGER: Failed to resume target '%s' (%d)!", target_name(ctx->cpus[k]), res);
				return res;
			}
		}
	}
	// wait for block switch (command sent), so we can disconnect from targets
	old_block_id = target_state[fired_target_num].block_id;
	if (duration_start(&wait_time) != 0) {
		LOG_ERROR("Failed to start trace stop timeout measurement!");
		return ERROR_FAIL;
	}
	// we are waiting for the last data from TRAX block and also there can be data in the pended data buffer
	// so we are expecting two TRX block switches at most or stopping due to timeout
	while (cmd_data->sv_trace_running) {
		res = esp_apptrace_get_data_info(ctx, target_state, &fired_target_num);
		if (res != ERROR_OK) {
			LOG_ERROR("SEGGER: Failed to read targets data info!");
			return res;
		}
		if (fired_target_num == (uint32_t)-1) {
			// it can happen that there is no pending (last) target data, but block was switched
			// in this case block_ids on both CPUs are equal, so select the first one
			fired_target_num = 0;
		}
		if (target_state[fired_target_num].block_id != old_block_id) {
			if (target_state[fired_target_num].data_len) {
				// read last data and ack them
				res = esp108_apptrace_read_data(ctx->cpus[fired_target_num], target_state[fired_target_num].data_len,
												block->data, target_state[fired_target_num].block_id,
												1/*ack target data*/, NULL);
				if (res != ERROR_OK) {
					LOG_ERROR("SEGGER: Failed to read last data on (%s)!", target_name(ctx->cpus[fired_target_num]));
				} else {
					if (ctx->cores_num > 1) {
						// ack target data on another CPU
						empty_target_num = fired_target_num ? 0 : 1;
						res = esp108_apptrace_write_ctrl_reg(ctx->cpus[empty_target_num], target_state[fired_target_num].block_id,
															0/*all read*/, 1/*host connected*/, 0 /*no host data*/);
						if (res != ERROR_OK) {
							LOG_ERROR("SEGGER: Failed to ack data on target '%s' (%d)!", target_name(ctx->cpus[empty_target_num]), res);
							return res;
						}
					}
					// process data
					block->data_len = target_state[fired_target_num].data_len;
					res = esp_apptrace_handle_trace_block(ctx, block);
					if (res != ERROR_OK) {
						LOG_ERROR("Failed to process trace block %d bytes!", block->data_len);
						return res;
					}
				}
				old_block_id = target_state[fired_target_num].block_id;
			}
		}
		if (duration_measure(&wait_time) != 0) {
			LOG_ERROR("Failed to start trace stop timeout measurement!");
			return ERROR_FAIL;
		}
		if (duration_elapsed(&wait_time) >= 0.5) {
			LOG_INFO("Stop waiting for the last data due to timeout.");
			break;
		}
	}
	return res;
}

static uint32_t esp_apptrace_usr_block_check(struct esp_apptrace_cmd_ctx *ctx, struct esp_apptrace_target2host_hdr *hdr)
{
	uint32_t wr_len = 0, usr_len = 0;
	if (ctx->mode == ESP_APPTRACE_CMD_MODE_SYSVIEW) {
		wr_len = ESP_SYSVIEW_USER_BLOCK_LEN(hdr->sys_view.wr_sz);
		usr_len = ESP_SYSVIEW_USER_BLOCK_LEN(hdr->sys_view.block_sz);
	} else {
		wr_len = ESP_APPTRACE_USER_BLOCK_LEN(hdr->gen.wr_sz);
		usr_len = ESP_APPTRACE_USER_BLOCK_LEN(hdr->gen.block_sz);
	}
	if (usr_len != wr_len) {
		LOG_ERROR("Incomplete block sz %u, wr %u", usr_len, wr_len);
		ctx->stats.incompl_blocks++;
		ctx->stats.lost_bytes += usr_len - wr_len;
	}
	return usr_len;
}

