espressif/openocd-esp32/src/target/esp108_apptrace.c
static int esp_apptrace_get_data_info(struct esp_apptrace_cmd_ctx *ctx, struct esp108_apptrace_target_state *target_state, uint32_t *fired_target_num)
{
    if (fired_target_num) {
        *fired_target_num = (uint32_t)-1;
    }
    memset(target_state, 0, ctx->cores_num*sizeof(*target_state));
    for (int i = 0; i < ctx->cores_num; i++) {
        int res = esp108_apptrace_read_data_len(ctx->cpus[i], &target_state[i].block_id, &target_state[i].data_len);
        if (res != ERROR_OK) {
            LOG_ERROR("Failed to read data len on (%s)!", target_name(ctx->cpus[i]));
            return res;
        }
        if (target_state[i].data_len) {
            LOG_DEBUG("Block %d, len %d bytes on fired target (%s)!",
                target_state[i].block_id, target_state[i].data_len, target_name(ctx->cpus[i]));
            if (fired_target_num) {
                *fired_target_num = (uint32_t)i;
            }
            break;
        }
    }
    return ERROR_OK;
}

uint8_t *esp108_apptrace_usr_block_get(uint8_t *buffer, uint32_t *size)
{
    struct esp_apptrace_target2host_hdr tmp_hdr;
    memcpy(&tmp_hdr, buffer, sizeof(tmp_hdr));

    *size = tmp_hdr.gen.wr_sz;

    return buffer + sizeof(struct esp_apptrace_target2host_hdr);
}

int esp108_apptrace_usr_block_write(struct target *target, uint32_t block_id, const uint8_t *data, uint32_t size)
{
    struct esp_apptrace_host2target_hdr hdr = {.block_sz = size};
    uint32_t buf_sz[2] = {sizeof(struct esp_apptrace_host2target_hdr), size};
    const uint8_t *bufs[2] = {(const uint8_t *)&hdr, data};

    if (size > ESP32_USR_BLOCK_SZ_MAX) {
        LOG_ERROR("Too large user block %u", size);
        return ERROR_FAIL;
    }

    return esp108_apptrace_write_buffs(target, 2, buf_sz, bufs, block_id, 1/*ack target data*/, 1/*host data*/);
}

static int esp_apptrace_process_data(struct esp_apptrace_cmd_ctx *ctx, int core_id, uint8_t *data, uint32_t data_len)
{
	struct esp_apptrace_cmd_data *cmd_data = ctx->cmd_priv;

	LOG_DEBUG("Got block %d bytes [%x %x...%x %x]", data_len, data[12], data[13], data[data_len-2], data[data_len-1]);
	if (ctx->tot_len + data_len > cmd_data->skip_len) {
		uint32_t wr_idx = 0, wr_chunk_len = data_len;
		if (ctx->tot_len < cmd_data->skip_len) {
			wr_chunk_len = (ctx->tot_len + wr_chunk_len) - cmd_data->skip_len;
			wr_idx = cmd_data->skip_len - ctx->tot_len;
		}
		if (ctx->tot_len + wr_chunk_len > cmd_data->max_len)
			wr_chunk_len -= (ctx->tot_len + wr_chunk_len - cmd_data->skip_len) - cmd_data->max_len;
		if (wr_chunk_len > 0) {
			int res = cmd_data->data_dests[0].write(cmd_data->data_dests[0].priv, data + wr_idx, wr_chunk_len);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to write %u bytes to dest 0!", data_len);
				return res;
			}
		}
		ctx->tot_len += wr_chunk_len;
	}
	else {
		ctx->tot_len += data_len;
	}
	LOG_USER("%u ", ctx->tot_len);
	// check for stop condition
	if ((ctx->tot_len > cmd_data->skip_len) && (ctx->tot_len - cmd_data->skip_len >= cmd_data->max_len)) {
		ctx->running = 0;
		if (duration_measure(&ctx->read_time) != 0) {
			LOG_ERROR("Failed to stop trace read time measure!");
			return ERROR_FAIL;
		}
	}
	return ERROR_OK;
}

static uint32_t esp_sysview_decode_u32(uint8_t **ptr)
{
	uint32_t val = 0;
	for (int k = 0; ; k++, (*ptr)++) {
		if (**ptr & 0x80) {
			val |= (uint32_t)(**ptr & ~0x80) << 7*k;
		} else {
			val |= (uint32_t)**ptr << 7*k;
			(*ptr)++;
			break;
		}
	}
	return val;
}

static uint16_t esp_sysview_decode_plen(uint8_t **ptr)
{
  uint16_t payload_len = 0;
  uint8_t *p = *ptr;
  // here pkt points to encoded payload length
  if (*p & 0x80) {
	payload_len = *(p + 1); // higher part
	payload_len = (payload_len << 7) | (*p & ~0x80); // lower 7 bits
	p += 2; // payload len (2 bytes)
  } else {
	payload_len = *p;
	p++; // payload len (1 byte)
  }
  *ptr = p;

  return payload_len;
}

static uint16_t esp_sysview_get_predef_payload_len(uint16_t id, uint8_t *pkt)
{
	uint16_t len;
	uint8_t *ptr = pkt;

	switch (id) {
		case SYSVIEW_EVTID_OVERFLOW:
		case SYSVIEW_EVTID_ISR_ENTER:
		case SYSVIEW_EVTID_TASK_START_EXEC:
		case SYSVIEW_EVTID_TASK_START_READY:
		case SYSVIEW_EVTID_TASK_CREATE:
		case SYSVIEW_EVTID_SYSTIME_CYCLES:
		case SYSVIEW_EVTID_USER_START:
		case SYSVIEW_EVTID_USER_STOP:
		case SYSVIEW_EVTID_TIMER_ENTER:
			//ENCODE_U32
			esp_sysview_decode_u32(&ptr);
			len = ptr - pkt;
			break;
		case SYSVIEW_EVTID_TASK_STOP_READY:
		case SYSVIEW_EVTID_SYSTIME_US:
			//2*ENCODE_U32
			esp_sysview_decode_u32(&ptr);
			esp_sysview_decode_u32(&ptr);
			len = ptr - pkt;
			break;
		case SYSVIEW_EVTID_SYSDESC:
			//str(128 + 1)
			len = *ptr + 1;
			break;
		case SYSVIEW_EVTID_TASK_INFO:
		case SYSVIEW_EVTID_MODULEDESC:
			//2*ENCODE_U32 + str
			esp_sysview_decode_u32(&ptr);
			esp_sysview_decode_u32(&ptr);
			// TODO: add support for strings longer then 255 bytes
			len = ptr - pkt + *ptr + 1;
			break;
		case SYSVIEW_EVTID_STACK_INFO:
			//4*ENCODE_U32
			esp_sysview_decode_u32(&ptr);
			esp_sysview_decode_u32(&ptr);
			esp_sysview_decode_u32(&ptr);
			esp_sysview_decode_u32(&ptr);
			len = ptr - pkt;
			break;
		case SYSVIEW_EVTID_ISR_EXIT:
		case SYSVIEW_EVTID_TASK_STOP_EXEC:
		case SYSVIEW_EVTID_TRACE_START:
		case SYSVIEW_EVTID_TRACE_STOP:
		case SYSVIEW_EVTID_IDLE:
		case SYSVIEW_EVTID_ISR_TO_SCHEDULER:
		case SYSVIEW_EVTID_TIMER_EXIT:
			len = 0;
			break;

		//case SYSVIEW_EVTID_NOP:
		default:
			LOG_ERROR("SEGGER: Unsupported predef event %d!", id);
			len = 0;
	}
	return len;
}

static uint16_t esp_sysview_parse_packet(uint8_t *pkt_buf, uint32_t *pkt_len, int *pkt_core_id, uint32_t *delta, uint32_t *delta_len)
{
	uint8_t *pkt = pkt_buf;
	uint16_t event_id = 0, payload_len = 0;

	*pkt_core_id = 0;
	*pkt_len = 0;
	// 1-2 byte of message type, 0-2  byte of payload length, payload, 1-5 bytes of timestamp.
	if (*pkt & 0x80) {
		if (*(pkt + 1) & (1 << 6)) {
			*(pkt + 1) &= ~(1 << 6); // clear core_id bit
			*pkt_core_id = 1;
		}
		event_id = *(pkt + 1); // higher part
		event_id = (event_id << 7) | (*pkt & ~0x80); // lower 7 bits
		pkt += 2; // event_id (2 bytes)
		// here pkt points to encoded payload length
		payload_len = esp_sysview_decode_plen(&pkt);
	} else {
		if (*pkt & (1 << 6)) {
			*pkt &= ~(1 << 6); // clear core_id bit
			*pkt_core_id = 1;
		}
		// event_id (1 byte)
		event_id = *pkt;
		pkt++;
		if (event_id < 24) {
			payload_len = esp_sysview_get_predef_payload_len(event_id, pkt);
		} else {
			payload_len = esp_sysview_decode_plen(&pkt);
		}
	}
	pkt += payload_len;
	uint8_t *delta_start = pkt;
	*delta = esp_sysview_decode_u32(&pkt);
	*delta_len = pkt - delta_start;
	*pkt_len = pkt - pkt_buf;
	LOG_DEBUG("SEGGER: evt %d len %d plen %d dlen %d", event_id, *pkt_len, payload_len, *delta_len);
	return event_id;
}

static int esp_sysview_process_data(struct esp_apptrace_cmd_ctx *ctx, int core_id, uint8_t *data, uint32_t data_len)
{
	struct esp_apptrace_cmd_data *cmd_data = ctx->cmd_priv;

	LOG_DEBUG("SEGGER: Read from target %d bytes [%x %x %x %x]", data_len, data[0], data[1], data[2], data[3]);
	int res;
	uint32_t processed = 0;
	if (core_id >= ctx->cores_num) {
		LOG_ERROR("SEGGER: Invalid core id %d in user block!", core_id);
		return ERROR_FAIL;
	}
	if (ctx->tot_len == 0) {
		// handle sync seq
		if (data_len < SYSVIEW_SYNC_LEN) {
			LOG_ERROR("SEGGER: Invalid init seq len %d!", data_len);
			return ERROR_FAIL;
		}
		LOG_DEBUG("SEGGER: Process %d sync bytes", SYSVIEW_SYNC_LEN);
		uint8_t sync_seq[SYSVIEW_SYNC_LEN] = {0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0};
		if (memcmp(data, sync_seq, SYSVIEW_SYNC_LEN) != 0) {
			LOG_ERROR("SEGGER: Invalid init seq [%x %x %x %x %x %x %x %x %x %x]",
				data[0], data[1], data[2], data[3], data[4], data[5], data[6], data[7], data[8], data[9]);
			return ERROR_FAIL;
		}
		res = cmd_data->data_dests[core_id].write(cmd_data->data_dests[core_id].priv, data, SYSVIEW_SYNC_LEN);
		if (res != ERROR_OK) {
			LOG_ERROR("SEGGER: Failed to write %u sync bytes to dest %d!", SYSVIEW_SYNC_LEN, core_id);
			return res;
		}
		if (ctx->cores_num > 1) {
			res = cmd_data->data_dests[core_id ? 0 : 1].write(cmd_data->data_dests[core_id ? 0 : 1].priv, data, SYSVIEW_SYNC_LEN);
			if (res != ERROR_OK) {
				LOG_ERROR("SEGGER: Failed to write %u sync bytes to dest %d!", SYSVIEW_SYNC_LEN, core_id ? 0 : 1);
				return res;
			}
		}
		ctx->tot_len += SYSVIEW_SYNC_LEN;
		processed += SYSVIEW_SYNC_LEN;
	}
	while (processed < data_len) {
		int pkt_core_id, pkt_core_changed = 0;
		uint32_t delta_len = 0, new_delta_len = 0;
		uint8_t new_delta_buf[10];
		uint32_t pkt_len = 0, delta = 0, wr_len;
		uint16_t event_id = esp_sysview_parse_packet(data + processed, &pkt_len, &pkt_core_id, &delta, &delta_len);
		LOG_DEBUG("SEGGER: Process packet %d id %d bytes [%x %x %x %x]", event_id, pkt_len, data[processed+0], data[processed+1], data[processed+2], data[processed+3]);
		wr_len = pkt_len;
		if (ctx->cores_num > 1) {
			if (cmd_data->sv_last_core_id == pkt_core_id) {
				// if this packet is for the same core as the prev one acc delta and write packet unmodified
				cmd_data->sv_acc_time_delta += delta;
			} else {
				// if this packet is for another core then prev one set acc delta to the packet's delta
				uint8_t *delta_ptr = new_delta_buf;
				SYSVIEW_ENCODE_U32(delta_ptr, delta + cmd_data->sv_acc_time_delta);
				cmd_data->sv_acc_time_delta = delta;
				wr_len -= delta_len;
				new_delta_len = delta_ptr - new_delta_buf;
				pkt_core_changed = 1;
			}
			cmd_data->sv_last_core_id = pkt_core_id;
		}
		res = cmd_data->data_dests[pkt_core_id].write(cmd_data->data_dests[pkt_core_id].priv, data + processed, wr_len);
		if (res != ERROR_OK) {
			LOG_ERROR("SEGGER: Failed to write %u bytes to dest %d!", wr_len, core_id);
			return res;
		}
		if (new_delta_len) {
			// write packet with modified delta
			res = cmd_data->data_dests[pkt_core_id].write(cmd_data->data_dests[pkt_core_id].priv, new_delta_buf, new_delta_len);
			if (res != ERROR_OK) {
				LOG_ERROR("SEGGER: Failed to write %u bytes of delta to dest %d!", new_delta_len, core_id);
				return res;
			}
		}
		if (ctx->cores_num > 1) {
			// handle other core dest
			int other_core_id = pkt_core_id ? 0 : 1;
			switch (event_id)
			{
				/* messages below should be sent to trace destinations for all cores */
				case SYSVIEW_EVTID_TRACE_START:
				case SYSVIEW_EVTID_TRACE_STOP:
				case SYSVIEW_EVTID_SYSTIME_CYCLES:
				case SYSVIEW_EVTID_SYSTIME_US:
				case SYSVIEW_EVTID_SYSDESC:
				case SYSVIEW_EVTID_TASK_INFO:
				case SYSVIEW_EVTID_STACK_INFO:
				case SYSVIEW_EVTID_MODULEDESC:
				case SYSVIEW_EVTID_INIT:
				case SYSVIEW_EVTID_NUMMODULES:
				case SYSVIEW_EVTID_OVERFLOW:
				case SYSVIEW_EVTID_TASK_START_READY:
					// if packet's source core has changed
					wr_len = pkt_len;
					if (pkt_core_changed) {
						// clone packet with unmodified delta
						new_delta_len = 0;
					} else {
						// clone packet with modified delta
						uint8_t *delta_ptr = new_delta_buf;
						SYSVIEW_ENCODE_U32(delta_ptr, cmd_data->sv_acc_time_delta /*delta has been accumulated above*/);
						wr_len -= delta_len;
						new_delta_len = delta_ptr - new_delta_buf;
					}
					LOG_DEBUG("SEGGER: Redirect %d bytes of event %d to dest %d", wr_len, event_id, other_core_id);
					res = cmd_data->data_dests[other_core_id].write(cmd_data->data_dests[other_core_id].priv, data + processed, wr_len);
					if (res != ERROR_OK) {
						LOG_ERROR("SEGGER: Failed to write %u bytes to dest %d!", wr_len, other_core_id);
						return res;
					}
					if (new_delta_len) {
						// write packet with modified delta
						res = cmd_data->data_dests[other_core_id].write(cmd_data->data_dests[other_core_id].priv, new_delta_buf, new_delta_len);
						if (res != ERROR_OK) {
							LOG_ERROR("SEGGER: Failed to write %u bytes of delta to dest %d!", new_delta_len, other_core_id);
							return res;
						}
					}
					// messages above are cloned to trace files for both cores, so reset acc time delta, both files have actual delta info
					cmd_data->sv_acc_time_delta = 0;
					break;
				default:
					break;
			}
		}
		if (event_id == SYSVIEW_EVTID_TRACE_STOP) {
			cmd_data->sv_trace_running = 0;
		}
		ctx->tot_len += pkt_len;
		processed += pkt_len;
	}
	LOG_USER("%u ", ctx->tot_len);
	// check for stop condition
	if ((ctx->tot_len > cmd_data->skip_len) && (ctx->tot_len - cmd_data->skip_len >= cmd_data->max_len)) {
		ctx->running = 0;
		if (duration_measure(&ctx->read_time) != 0) {
			LOG_ERROR("Failed to stop trace read time measure!");
			return ERROR_FAIL;
		}
	}
	return ERROR_OK;
}

static int esp_apptrace_handle_trace_block(struct esp_apptrace_cmd_ctx *ctx, struct esp_apptrace_block *block)
{
	uint32_t processed = 0;
	uint32_t hdr_sz = ctx->mode == ESP_APPTRACE_CMD_MODE_SYSVIEW ? ESP_SYSVIEW_USER_BLOCK_HDR_SZ : ESP_APPTRACE_USER_BLOCK_HDR_SZ;
	LOG_DEBUG("Got block %d bytes", block->data_len);
	// process user blocks one by one
	while (processed < block->data_len) {
		LOG_DEBUG("Process usr block %d/%d", processed, block->data_len);
		struct esp_apptrace_target2host_hdr tmp_hdr;
		memcpy(&tmp_hdr, block->data + processed, sizeof(tmp_hdr));
		struct esp_apptrace_target2host_hdr *hdr = &tmp_hdr;
		// process user block
		uint32_t usr_len = esp_apptrace_usr_block_check(ctx, hdr);
		int core_id;
		if (ctx->mode == ESP_APPTRACE_CMD_MODE_SYSVIEW) {
			core_id = ESP_SYSVIEW_USER_BLOCK_CORE(hdr->sys_view.block_sz);
		} else {
			core_id = ESP_APPTRACE_USER_BLOCK_CORE(hdr->gen.block_sz);
		}
		// process user data
		int res = ctx->process_data(ctx, core_id, block->data + processed + hdr_sz, usr_len);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to process %d bytes!", usr_len);
			return res;
		}
		processed += usr_len + hdr_sz;
	}
	return ERROR_OK;
}

static void *esp_apptrace_data_processor(void *arg)
{
	long res = ERROR_OK;
	struct esp_apptrace_cmd_ctx *ctx = (struct esp_apptrace_cmd_ctx *)arg;

