espressif/openocd-esp32/src/target/esp108_apptrace.c
	while(ctx->running) {
		struct esp_apptrace_block *block = esp_apptrace_ready_block_get(ctx);
		if (!block) {
			continue;
		}
		res = esp_apptrace_handle_trace_block(ctx, block);
		if (res != ERROR_OK) {
			ctx->running = 0;
			LOG_ERROR("Failed to process trace block %d bytes!", block->data_len);
			break;
		}
		res = esp_apptrace_block_free(ctx, block);
		if (res != ERROR_OK) {
			ctx->running = 0;
			LOG_ERROR("Failed to free ready block!");
			break;
		}
	}

	return (void *)res;
}

static int esp_apptrace_poll(void *priv)
{
	struct esp_apptrace_cmd_ctx *ctx = (struct esp_apptrace_cmd_ctx *)priv;
	int res;
	uint32_t fired_target_num = 0;
	struct esp108_apptrace_target_state target_state[ESP_APPTRACE_TARGETS_NUM_MAX];
#if ESP_APPTRACE_TIME_STATS_ENABLE
	struct duration blk_proc_time;
#endif

	if (!ctx->running) {
		return ERROR_FAIL;
	}

	// check for data from target
	res = esp_apptrace_get_data_info(ctx, target_state, &fired_target_num);
	if (res != ERROR_OK) {
		ctx->running = 0;
		LOG_ERROR("Failed to read data len!");
		return res;
	}
	if (fired_target_num == (uint32_t)-1) {
		// no data has been received, but block could be switched due to the data transfered from host to target
		if (ctx->cores_num > 1) {
			uint32_t max_block_id = 0, min_block_id = ESP_APPTRACE_BLOCK_ID_MAX;
			// find maximum block ID and set the same ID in control reg for both blocks;
			for (int i = 0; i < ctx->cores_num; i++) {
				if (max_block_id < target_state[i].block_id) {
					max_block_id = target_state[i].block_id;
				}
				if (min_block_id > target_state[i].block_id) {
					min_block_id = target_state[i].block_id;
				}
			}
			// handle block ID overflow
			if (max_block_id == ESP_APPTRACE_BLOCK_ID_MAX && min_block_id == 0) {
				max_block_id = 0;
			}
			for (int i = 0; i < ctx->cores_num; i++) {
				if (max_block_id != target_state[i].block_id) {
					LOG_DEBUG("Ack empty block %d on target (%s)!", max_block_id, target_name(ctx->cpus[i]));
					res = esp108_apptrace_write_ctrl_reg(ctx->cpus[i], max_block_id,
														 0/*all read*/, 1/*host connected*/, 0/*no host data*/);
					if (res != ERROR_OK) {
						ctx->running = 0;
						LOG_ERROR("Failed to ack empty data block on (%s)!", target_name(ctx->cpus[i]));
						return res;
					}
				}
			}
			ctx->last_blk_id = max_block_id;
		}
		if (ctx->stop_tmo != -1.0) {
			if (duration_measure(&ctx->idle_time) != 0) {
				ctx->running = 0;
				LOG_ERROR("Failed to measure idle time!");
				return ERROR_FAIL;
			}
			if (duration_elapsed(&ctx->idle_time) >= ctx->stop_tmo) {
				ctx->running = 0;
				LOG_ERROR("Data timeout!");
				return ERROR_FAIL;
			}
		}
		return ERROR_OK; // no data
	}
	// sanity check
	if (target_state[fired_target_num].data_len > ctx->trax_block_sz) {
		ctx->running = 0;
		LOG_ERROR("Too large block size %d!", target_state[fired_target_num].data_len);
		return ERROR_FAIL;
	}
	if (ctx->tot_len == 0) {
		if (duration_start(&ctx->read_time) != 0) {
			ctx->running = 0;
			LOG_ERROR("Failed to start trace read time measurement!");
			return ERROR_FAIL;
		}
	}
	struct esp_apptrace_block *block = esp_apptrace_free_block_get(ctx);
	if (!block) {
		ctx->running = 0;
		LOG_ERROR("Failed to get free block for data on (%s)!", target_name(ctx->cpus[fired_target_num]));
		return ERROR_FAIL;
	}
#if ESP_APPTRACE_TIME_STATS_ENABLE
	// read block
	if (duration_start(&blk_proc_time) != 0) {
		ctx->running = 0;
		LOG_ERROR("Failed to start block read time measurement!");
		return ERROR_FAIL;
	}
#endif
	res = esp108_apptrace_read_data(ctx->cpus[fired_target_num], target_state[fired_target_num].data_len,
									block->data, target_state[fired_target_num].block_id,
									1/*ack target data*/, NULL);
	if (res != ERROR_OK) {
		ctx->running = 0;
		LOG_ERROR("Failed to read data on (%s)!", target_name(ctx->cpus[fired_target_num]));
		return res;
	}
	ctx->last_blk_id = target_state[fired_target_num].block_id;
#if ESP_APPTRACE_TIME_STATS_ENABLE
	if (duration_measure(&blk_proc_time) != 0) {
		ctx->running = 0;
		LOG_ERROR("Failed to measure block read time!");
		return ERROR_FAIL;
	}
	// update stats
	float brt = duration_elapsed(&blk_proc_time);
	if (brt > ctx->stats.max_blk_read_time)
		ctx->stats.max_blk_read_time = brt;
	if (brt < ctx->stats.min_blk_read_time)
		ctx->stats.min_blk_read_time = brt;

	if (duration_start(&blk_proc_time) != 0) {
		ctx->running = 0;
		LOG_ERROR("Failed to start block proc time measurement!");
		return ERROR_FAIL;
	}
#endif
	if (ctx->cores_num > 1) {
		res = esp108_apptrace_write_ctrl_reg(ctx->cpus[fired_target_num ? 0 : 1], ctx->last_blk_id,
											 0/*all read*/, 1/*host connected*/, 0/*no host data*/);
		if (res != ERROR_OK) {
			ctx->running = 0;
			LOG_ERROR("Failed to ack data on (%s)!", target_name(ctx->cpus[fired_target_num ? 0 : 1]));
			return res;
		}
		LOG_DEBUG("Ack block %d target (%s)!", ctx->last_blk_id, target_name(ctx->cpus[fired_target_num ? 0 : 1]));
	}
	ctx->raw_tot_len += target_state[fired_target_num].data_len;

	block->data_len = target_state[fired_target_num].data_len;
	if (ctx->mode == ESP_APPTRACE_CMD_MODE_SYNC) {
		res = esp_apptrace_handle_trace_block(ctx, block);
		if (res != ERROR_OK) {
			ctx->running = 0;
			LOG_ERROR("Failed to process trace block %d bytes!", block->data_len);
			return res;
		}
		res = esp_apptrace_block_free(ctx, block);
		if (res != ERROR_OK) {
			ctx->running = 0;
			LOG_ERROR("Failed to free ready block!");
			return res;
		}
	} else {
		res = esp_apptrace_ready_block_put(ctx, block);
		if (res != ERROR_OK) {
			ctx->running = 0;
			LOG_ERROR("Failed to put ready block of data from (%s)!", target_name(ctx->cpus[fired_target_num]));
			return res;
		}
	}
	if (ctx->stop_tmo != -1.0) {
		// start idle time measurement
		if (duration_start(&ctx->idle_time) != 0) {
			ctx->running = 0;
			LOG_ERROR("Failed to start idle time measure!");
			return ERROR_FAIL;
		}
	}
#if ESP_APPTRACE_TIME_STATS_ENABLE
	if (duration_measure(&blk_proc_time) != 0) {
		ctx->running = 0;
		LOG_ERROR("Failed to stop block proc time measure!");
		return ERROR_FAIL;
	}
	// update stats
	float bt = duration_elapsed(&blk_proc_time);
	if (bt > ctx->stats.max_blk_proc_time)
		ctx->stats.max_blk_proc_time = bt;
	if (bt < ctx->stats.min_blk_proc_time)
		ctx->stats.min_blk_proc_time = bt;
#endif
	return ERROR_OK;
}

int esp_cmd_apptrace_generic(struct target *target, int mode, const char **argv, int argc)
{
	static struct esp_apptrace_cmd_ctx s_at_cmd_ctx;
	struct esp_apptrace_cmd_data *cmd_data;
	int res = ERROR_OK;
    enum target_state old_state = target->state;

