espressif/openocd-esp32/src/target/esp108_apptrace.c
	if (argc < 1) {
		LOG_ERROR("Action missed!");
		return ERROR_FAIL;
	}

	if (strcmp(argv[0], "start") == 0) {
		// init cmd context
		res = esp_apptrace_cmd_init(target, &s_at_cmd_ctx, mode, &argv[1], argc-1);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to init cmd ctx (%d)!", res);
			return res;
		}
		cmd_data = s_at_cmd_ctx.cmd_priv;
		if (mode == ESP_APPTRACE_CMD_MODE_SYSVIEW) {
			if (cmd_data->skip_len != 0) {
				LOG_ERROR("Data skipping not supported!");
				s_at_cmd_ctx.running = 0;
				esp_apptrace_cmd_cleanup(&s_at_cmd_ctx);
				return ERROR_FAIL;
			}
			s_at_cmd_ctx.process_data = esp_sysview_process_data;
			res = esp_sysview_write_trace_header(&s_at_cmd_ctx);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to write trace header (%d)!", res);
				s_at_cmd_ctx.running = 0;
				esp_apptrace_cmd_cleanup(&s_at_cmd_ctx);
				return res;
			}
		}
		else {
			s_at_cmd_ctx.process_data = esp_apptrace_process_data;
		}
		if (cmd_data->wait4halt) {
			res = esp_apptrace_wait4halt(&s_at_cmd_ctx);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to wait for halt target (%d)!", res);
				s_at_cmd_ctx.running = 0;
				esp_apptrace_cmd_cleanup(&s_at_cmd_ctx);
				return res;
			}
		}
		res = esp_apptrace_connect_targets(&s_at_cmd_ctx, true, old_state == TARGET_RUNNING);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to connect to targets (%d)!", res);
			s_at_cmd_ctx.running = 0;
			esp_apptrace_cmd_cleanup(&s_at_cmd_ctx);
			return res;
		}
		if (mode == ESP_APPTRACE_CMD_MODE_SYSVIEW) {
			// start tracing
			res = esp_sysview_start(&s_at_cmd_ctx);
			if (res != ERROR_OK) {
				LOG_ERROR("SEGGER: Failed to start tracing!");
				esp_apptrace_connect_targets(&s_at_cmd_ctx, false, old_state == TARGET_RUNNING);
				s_at_cmd_ctx.running = 0;
				esp_apptrace_cmd_cleanup(&s_at_cmd_ctx);
				return res;
			}
		}
		// openocd timer_callback min period is 1 ms, if we need to poll target for trace data more frequently polling loop will be used
		if (cmd_data->poll_period >= 1) {
			res = target_register_timer_callback(esp_apptrace_poll, cmd_data->poll_period, 1, &s_at_cmd_ctx);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to register target timer handler (%d)!", res);
				return res;
			}
		}
		else { ////////////////// POLLING MODE ///////////////////////////
			/* check for exit signal and comand completion */
			while (!shutdown_openocd && s_at_cmd_ctx.running) {
				res = esp_apptrace_poll(&s_at_cmd_ctx);
				if (res != ERROR_OK) {
					LOG_ERROR("Failed to poll target for trace data (%d)!", res);
					break;
				}
				/* let registered timer callbacks to run */
				target_call_timer_callbacks();
			}
			// if we stopped due to user pressed CTRL+C
			if (shutdown_openocd) {
				if (duration_measure(&s_at_cmd_ctx.read_time) != 0) {
					LOG_ERROR("Failed to stop trace read time measurement!");
				}
			}
			if (s_at_cmd_ctx.running) {
				// data processor is alive, so wait for all received blocks to be processed
				res = esp_apptrace_wait_pended_blocks(&s_at_cmd_ctx);
				if (res != ERROR_OK) {
					LOG_ERROR("Failed to wait for pended blocks (%d)!", res);
				}
				// signal thread to stop
				s_at_cmd_ctx.running = 0;
			}
			if (mode == ESP_APPTRACE_CMD_MODE_SYSVIEW) {
				// stop tracing
				res = esp_sysview_stop(&s_at_cmd_ctx);
				if (res != ERROR_OK) {
					LOG_ERROR("SEGGER: Failed to stop tracing!");
				}
			}
            res = esp_apptrace_connect_targets(&s_at_cmd_ctx, false, old_state == TARGET_RUNNING);
            if (res != ERROR_OK) {
                LOG_ERROR("Failed to disconnect targets (%d)!", res);
            }
            esp_apptrace_print_stats(&s_at_cmd_ctx);
            res = esp_apptrace_cmd_cleanup(&s_at_cmd_ctx);
            if (res != ERROR_OK) {
                LOG_ERROR("Failed to cleanup cmd ctx (%d)!", res);
            }
		}
	}
	else if (strcmp(argv[0], "stop") == 0) {
		if (!s_at_cmd_ctx.running) {
			LOG_WARNING("Tracing is not running!");
			return ERROR_FAIL;
		}
		if (duration_measure(&s_at_cmd_ctx.read_time) != 0) {
			LOG_ERROR("Failed to stop trace read time measurement!");
		}
		// data processor is alive, so wait for all received blocks to be processed
		res = esp_apptrace_wait_pended_blocks(&s_at_cmd_ctx);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to wait for pended blocks (%d)!", res);
		}
		// signal thread to stop
		s_at_cmd_ctx.running = 0;
		res = target_unregister_timer_callback(esp_apptrace_poll, &s_at_cmd_ctx);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to unregister target timer handler (%d)!", res);
		}
		if (mode == ESP_APPTRACE_CMD_MODE_SYSVIEW) {
			// stop tracing
			res = esp_sysview_stop(&s_at_cmd_ctx);
			if (res != ERROR_OK) {
				LOG_ERROR("SEGGER: Failed to stop tracing!");
			}
		}
		res = esp_apptrace_connect_targets(&s_at_cmd_ctx, false, old_state == TARGET_RUNNING);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to disconnect targets (%d)!", res);
		}
		esp_apptrace_print_stats(&s_at_cmd_ctx);
		res = esp_apptrace_cmd_cleanup(&s_at_cmd_ctx);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to cleanup cmd ctx (%d)!", res);
		}
	}
	else if (strcmp(argv[0], "status") == 0) {
		if (s_at_cmd_ctx.running && duration_measure(&s_at_cmd_ctx.read_time) != 0) {
			LOG_ERROR("Failed to measure trace read time!");
		}
		esp_apptrace_print_stats(&s_at_cmd_ctx);
	}
	else if (strcmp(argv[0], "dump") == 0) {
		if (mode == ESP_APPTRACE_CMD_MODE_SYSVIEW) {
			LOG_ERROR("Not supported!");
			return ERROR_FAIL;
		}
		// [dump outfile] - post-mortem dump without connection to targets
		res = esp_apptrace_cmd_init(target, &s_at_cmd_ctx, mode, &argv[1], argc-1);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to init cmd ctx (%d)!", res);
			return res;
		}
		s_at_cmd_ctx.stop_tmo = 0.01; // use small stop tmo
		s_at_cmd_ctx.process_data = esp_apptrace_process_data;
		/* check for exit signal and comand completion */
		while (!shutdown_openocd && s_at_cmd_ctx.running) {
			res = esp_apptrace_poll(&s_at_cmd_ctx);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to poll target for trace data (%d)!", res);
				break;
			}
			/* let registered timer callbacks to run */
			target_call_timer_callbacks();
		}
		if (s_at_cmd_ctx.running) {
			// data processor is alive, so wait for all received blocks to be processed
			res = esp_apptrace_wait_pended_blocks(&s_at_cmd_ctx);
			if (res != ERROR_OK) {
				LOG_ERROR("Failed to wait for pended blocks (%d)!", res);
			}
			// signal thread to stop
			s_at_cmd_ctx.running = 0;
		}
		esp_apptrace_print_stats(&s_at_cmd_ctx);
		res = esp_apptrace_cmd_cleanup(&s_at_cmd_ctx);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to cleanup cmd ctx (%d)!", res);
		}
	}
	else {
		LOG_ERROR("Invalid action '%s'!", argv[0]);
	}

	return res;
}

