espressif/openocd-esp32/src/target/esp108_apptrace.c
__COMMAND_HANDLER(esp108_cmd_apptrace)
{
	return esp_cmd_apptrace_generic(get_current_target(CMD_CTX), ESP_APPTRACE_CMD_MODE_GEN, CMD_ARGV, CMD_ARGC);
}

__COMMAND_HANDLER(esp108_cmd_sysview)
{
	return esp_cmd_apptrace_generic(get_current_target(CMD_CTX), ESP_APPTRACE_CMD_MODE_SYSVIEW, CMD_ARGV, CMD_ARGC);
}

static int esp_gcov_cmd_init(struct target *target, struct esp_apptrace_cmd_ctx *cmd_ctx, const char **argv, int argc)
{
	int res;

	res = esp_apptrace_cmd_ctx_init(target, cmd_ctx, ESP_APPTRACE_CMD_MODE_SYNC);
	if (res) {
		return res;
	}
	cmd_ctx->stop_tmo = 3.0;
	cmd_ctx->process_data = esp_gcov_process_data;

	struct esp_gcov_cmd_data *cmd_data = malloc(sizeof(struct esp_gcov_cmd_data));
	if (!cmd_data) {
		LOG_ERROR("Failed to alloc cmd data!");
		esp_apptrace_cmd_ctx_cleanup(cmd_ctx);
		return ERROR_FAIL;
	}
	memset(cmd_data, 0, sizeof(struct esp_gcov_cmd_data));
	cmd_ctx->cmd_priv = cmd_data;

	if (argc > 0) {
		cmd_data->wait4halt = strtoul(argv[0], NULL, 10);
	}

	return ERROR_OK;
}

static int esp_gcov_cmd_cleanup(struct esp_apptrace_cmd_ctx *cmd_ctx)
{
	struct esp_gcov_cmd_data *cmd_data = cmd_ctx->cmd_priv;
	int res = ERROR_OK;

	for (int i = 0; i < ESP_GCOV_FILES_MAX_NUM; i++) {
		if (cmd_data->files[i] && fclose(cmd_data->files[i])) {
			LOG_ERROR("Failed to close file 0x%p (%d)!", cmd_data->files[i], errno);
			res = ERROR_FAIL;
		}
	}
	free(cmd_data);
	esp_apptrace_cmd_ctx_cleanup(cmd_ctx);
	return res;
}

#ifdef _WIN32
#define DIR_SEPARATORS		("\\/")
#define IS_DIR_SEPARATOR(c)	(c == '\\' || c == '/')
#else
#define DIR_SEPARATORS		("/")
#define IS_DIR_SEPARATOR(c)	(c == '/')
#endif

static const char *esp_gcov_filename_alloc(const char *orig_fname)
{
	const char *gcov_prefix;
	size_t prefix_length;
	int strip = 0, orig_fname_len = strlen(orig_fname);

	if (orig_fname_len == 0) {
		return NULL;
	}
	/* Check if the level of dirs to strip off specified. */
	char *tmp = getenv("OPENOCD_GCOV_PREFIX_STRIP");
	if (tmp) {
		strip = atoi (tmp);
		/* Do not consider negative values. */
		if (strip < 0) {
			strip = 0;
		}
	}

	/* Get file name relocation prefix. Non-absolute values are ignored. */
	gcov_prefix = getenv("OPENOCD_GCOV_PREFIX");
	prefix_length = gcov_prefix ? strlen (gcov_prefix) : 0;

	/* Remove an unnecessary trailing '/' */
	if (prefix_length && IS_DIR_SEPARATOR(gcov_prefix[prefix_length - 1])) {
		prefix_length--;
	}

	/* If no prefix was specified and a prefix stip, then we assume relative.  */
	if (!prefix_length && strip) {
		gcov_prefix = ".";
		prefix_length = 1;
	}

	/* Allocate and initialize the filename scratch space.  */
	char *filename = (char *)malloc(prefix_length + orig_fname_len + 1);
	if (prefix_length) {
		memcpy(filename, gcov_prefix, prefix_length);
	}
	const char *striped_fname = orig_fname;
	while (strip--) {
		// assume that file path starts with '/', it is generated by GCC
		// under Windows we skip over drive letter and can look like `c:\esp\esp-idf\examples\system\gcov\build/esp-idf/main/CMakeFiles/__idf_main.dir/gcov_example.c.gcda`
		tmp = strpbrk(striped_fname+1, DIR_SEPARATORS);
		if (tmp == NULL) {
			break;
		}
		striped_fname = tmp;
	}
	if (strip > 0) {
		LOG_WARNING("Failed to srip %d dir names in Gcov file path '%s'!", strip, orig_fname);
	}
	strcpy(&filename[prefix_length], striped_fname);

	return filename;
}

static int esp_gcov_fopen(struct esp_gcov_cmd_data *cmd_data, uint8_t *data, uint32_t data_len, uint8_t **resp, uint32_t *resp_len)
{
	*resp_len = 0;
	if (cmd_data->files_num == ESP_GCOV_FILES_MAX_NUM) {
		LOG_ERROR("Max gcov files num exceeded!");
		return ERROR_FAIL;
	}

	if (data_len == 0) {
		LOG_ERROR("Missed FOPEN args!");
		return ERROR_FAIL;
	}
	int len = strlen((char *)data);
	if (len == 0) {
		LOG_ERROR("Missed FOPEN path arg!");
		return ERROR_FAIL;
	}
	if (data_len - len - 1 == 0) {
		LOG_ERROR("Missed FOPEN mode arg!");
		return ERROR_FAIL;
	}

	uint32_t fd = cmd_data->files_num;
	char *mode = (char *)data + len + 1;
	const char *fname = esp_gcov_filename_alloc((const char *)data);
	if (fname == NULL) {
		LOG_ERROR("Failed to alloc memory for file name!");
		return ERROR_FAIL;
	}
	LOG_INFO("Open file 0x%x '%s'", fd+1, fname);
	cmd_data->files[fd] = fopen(fname, mode);
	if (!cmd_data->files[fd]) {
		// do not report error on reading non-existent file
		if (errno != ENOENT || strchr(mode, 'r') == NULL) {
			LOG_ERROR("Failed to open file '%s', mode '%s' (%d)!", fname, mode, errno);
		}
		fd = 0;
	} else {
		fd++; // 1-based, 0 indicates error
	}

	*resp_len = sizeof(fd);
	*resp = malloc(*resp_len);
	if (!*resp) {
		LOG_ERROR("Failed to alloc mem for resp!");
		if (fd != 0) {
			fclose(cmd_data->files[fd-1]);
		}
		free((void *)fname);
		return ERROR_FAIL;
	}
	memcpy(*resp, &fd, sizeof(fd));

	if (fd != 0) {
		cmd_data->files_num++;
	}

	free((void *)fname);
	return ERROR_OK;
}

static int esp_gcov_fclose(struct esp_gcov_cmd_data *cmd_data, uint8_t *data, uint32_t data_len, uint8_t **resp, uint32_t *resp_len)
{
	*resp_len = 0;
	if (data_len < sizeof(uint32_t)) {
		LOG_ERROR("Missed FCLOSE args!");
		return ERROR_FAIL;
	}
	uint32_t fd;
	memcpy(&fd, data, sizeof(fd));
	fd--;
	if (fd >= ESP_GCOV_FILES_MAX_NUM) {
		LOG_ERROR("Invalid file desc received 0x%x!", fd);
		return ERROR_FAIL;
	}
	if (!cmd_data->files[fd]) {
		LOG_ERROR("FCLOSE for not open file!");
		return ERROR_FAIL;
	}

	LOG_DEBUG("Close file 0x%x", fd+1);
	int32_t fret = fclose(cmd_data->files[fd]);
	if (fret) {
		LOG_ERROR("Failed to close file %d (%d)!", fd, errno);
	} else {
		cmd_data->files[fd] = NULL;
	}

	*resp_len = sizeof(fret);
	*resp = malloc(*resp_len);
	if (!*resp) {
		LOG_ERROR("Failed to alloc mem for resp!");
		return ERROR_FAIL;
	}
	memcpy(*resp, &fret, sizeof(fret));

	return ERROR_OK;
}

static int esp_gcov_fwrite(struct esp_gcov_cmd_data *cmd_data, uint8_t *data, uint32_t data_len, uint8_t **resp, uint32_t *resp_len)
{
	*resp_len = 0;
	if (data_len < sizeof(uint32_t)) {
		LOG_ERROR("Missed FWRITE args!");
		return ERROR_FAIL;
	}
	uint32_t fd;
	memcpy(&fd, data, sizeof(fd));
	fd--;
	if (fd >= ESP_GCOV_FILES_MAX_NUM) {
		LOG_ERROR("Invalid file desc received 0x%x!", fd);
		return ERROR_FAIL;
	}
	if (!cmd_data->files[fd]) {
		LOG_ERROR("FWRITE for not open file!");
		return ERROR_FAIL;
	}

	LOG_DEBUG("Write file 0x%x %d bytes", fd+1, (int)(data_len - sizeof(fd)));
	uint32_t fret = fwrite(data + sizeof(fd), data_len - sizeof(fd), 1, cmd_data->files[fd]);
	if (fret != 1) {
		LOG_ERROR("Failed to write %ld byte (%d)!", (long)(data_len - sizeof(fd)), errno);
	}

	*resp_len = sizeof(fret);
	*resp = malloc(*resp_len);
	if (!*resp) {
		LOG_ERROR("Failed to alloc mem for resp!");
		return ERROR_FAIL;
	}
	memcpy(*resp, &fret, sizeof(fret));

	return ERROR_OK;
}

static int esp_gcov_fread(struct esp_gcov_cmd_data *cmd_data, uint8_t *data, uint32_t data_len, uint8_t **resp, uint32_t *resp_len)
{
	uint32_t fret;

	*resp_len = 0;
	if (data_len < 2*sizeof(uint32_t)) {
		LOG_ERROR("Missed FREAD args!");
		return ERROR_FAIL;
	}
	uint32_t fd;
	memcpy(&fd, data, sizeof(fd));
	fd--;
	if (fd >= ESP_GCOV_FILES_MAX_NUM) {
		LOG_ERROR("Invalid file desc received 0x%x!", fd);
		return ERROR_FAIL;
	}
	if (!cmd_data->files[fd]) {
		LOG_ERROR("FREAD for not open file!");
		return ERROR_FAIL;
	}
	uint32_t len;
	memcpy(&len, data + sizeof(fd), sizeof(len));

	*resp_len = sizeof(fret) + len;
	*resp = malloc(*resp_len);
	if (!*resp) {
		LOG_ERROR("Failed to alloc mem for resp!");
		return ERROR_FAIL;
	}
	LOG_DEBUG("Read file 0x%x %d bytes", fd+1, (int)len);
	fret = fread(*resp + sizeof(fret), 1, len, cmd_data->files[fd]);
	if (fret == 0) {
		LOG_ERROR("Failed to read %d byte (%d)!", len, errno);
	}
	*resp_len = sizeof(fret) + fret;
	memcpy(*resp, &fret, sizeof(fret));

	return ERROR_OK;
}

static int esp_gcov_fseek(struct esp_gcov_cmd_data *cmd_data, uint8_t *data, uint32_t data_len, uint8_t **resp, uint32_t *resp_len)
{
	*resp_len = 0;
	if (data_len < (sizeof(uint32_t) + 2*sizeof(int32_t))) {
		LOG_ERROR("Missed FSEEK args!");
		return ERROR_FAIL;
	}
	uint32_t fd;
	memcpy(&fd, data, sizeof(fd));
	fd--;
	if (fd >= ESP_GCOV_FILES_MAX_NUM) {
		LOG_ERROR("Invalid file desc received 0x%x!", fd);
		return ERROR_FAIL;
	}
	if (!cmd_data->files[fd]) {
		LOG_ERROR("FSEEK for not open file!");
		return ERROR_FAIL;
	}

	int32_t off;
	memcpy(&off, data + sizeof(fd), sizeof(off));
	int32_t whence;
	memcpy(&whence, data + sizeof(fd) + sizeof(off), sizeof(whence));

	int32_t fret = fseek(cmd_data->files[fd], off, whence);
	*resp_len = sizeof(fret);
	*resp = malloc(*resp_len);
	if (!*resp) {
		LOG_ERROR("Failed to alloc mem for resp!");
		return ERROR_FAIL;
	}
	memcpy(*resp, &fret, sizeof(fret));

	return ERROR_OK;
}

static int esp_gcov_ftell(struct esp_gcov_cmd_data *cmd_data, uint8_t *data, uint32_t data_len, uint8_t **resp, uint32_t *resp_len)
{
	*resp_len = 0;
	if (data_len < sizeof(uint32_t)) {
		LOG_ERROR("Missed FTELL args!");
		return ERROR_FAIL;
	}
	uint32_t fd;
	memcpy(&fd, data, sizeof(fd));
	fd--;
	if (fd >= ESP_GCOV_FILES_MAX_NUM) {
		LOG_ERROR("Invalid file desc received 0x%x!", fd);
		return ERROR_FAIL;
	}
	if (!cmd_data->files[fd]) {
		LOG_ERROR("FTELL for not open file!");
		return ERROR_FAIL;
	}

	int32_t fret = ftell(cmd_data->files[fd]);
	*resp_len = sizeof(fret);
	*resp = malloc(*resp_len);
	if (!*resp) {
		LOG_ERROR("Failed to alloc mem for resp!");
		return ERROR_FAIL;
	}
	memcpy(*resp, &fret, sizeof(fret));

	return ERROR_OK;
}

//TODO: support for multi-block data transfers
static int esp_gcov_process_data(struct esp_apptrace_cmd_ctx *ctx, int core_id, uint8_t *data, uint32_t data_len)
{
	int ret = ERROR_OK;
	struct esp_gcov_cmd_data *cmd_data = ctx->cmd_priv;
	uint8_t *resp;
	uint32_t resp_len = 0;

	LOG_DEBUG("Got block %d bytes [%x %x]", data_len, data[0], data[1]);

