espressif/openocd-esp32/src/target/esp108_apptrace.c
	if (data_len < 1) {
		LOG_ERROR("Too small data length %d!", data_len);
		return ERROR_FAIL;
	}

	switch (*data) {
		case ESP_APPTRACE_FILE_CMD_FOPEN:
			ret = esp_gcov_fopen(cmd_data, data+1, data_len-1, &resp, &resp_len);
			break;
		case ESP_APPTRACE_FILE_CMD_FCLOSE:
			ret = esp_gcov_fclose(cmd_data, data+1, data_len-1, &resp, &resp_len);
			break;
		case ESP_APPTRACE_FILE_CMD_FWRITE:
			ret = esp_gcov_fwrite(cmd_data, data+1, data_len-1, &resp, &resp_len);
			break;
		case ESP_APPTRACE_FILE_CMD_FREAD:
			ret = esp_gcov_fread(cmd_data, data+1, data_len-1, &resp, &resp_len);
			break;
		case ESP_APPTRACE_FILE_CMD_FSEEK:
			ret = esp_gcov_fseek(cmd_data, data+1, data_len-1, &resp, &resp_len);
			break;
		case ESP_APPTRACE_FILE_CMD_FTELL:
			ret = esp_gcov_ftell(cmd_data, data+1, data_len-1, &resp, &resp_len);
			break;
		case ESP_APPTRACE_FILE_CMD_STOP:
			ctx->running = 0;
			break;
		default:
			LOG_ERROR("Invalid FCMD 0x%x!", *data);
			ret = ERROR_FAIL;
	}
	if (ret != ERROR_OK) {
		return ret;
	}

	if (resp_len) {
		struct esp108_apptrace_target_state target_state[ESP_APPTRACE_TARGETS_NUM_MAX];
		uint32_t fired_target_num = 0;
		// get current block id
		int res = esp_apptrace_get_data_info(ctx, target_state, &fired_target_num);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to read target data info!");
			free(resp);
			return res;
		}
		if (fired_target_num == (uint32_t)-1) {
			// it can happen that there is no pending target data, but block was switched
			// in this case block_ids on both CPUs are equal, so select the first one
			fired_target_num = 0;
		}
		// write response
		res = esp108_apptrace_usr_block_write(ctx->cpus[fired_target_num], target_state[fired_target_num].block_id, resp, resp_len);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to write data to (%s)!", target_name(ctx->cpus[fired_target_num]));
			free(resp);
			return res;
		}
		free(resp);
	}

	return ERROR_OK;
}

int esp_gcov_poll(struct target *target, void *priv)
{
	int res = ERROR_OK;
	struct esp_apptrace_cmd_ctx *cmd_ctx = (struct esp_apptrace_cmd_ctx *)priv;

	while (!shutdown_openocd && target->state != TARGET_HALTED && cmd_ctx->running) {
		res = esp_apptrace_poll(cmd_ctx);
		if (res != ERROR_OK) {
			LOG_ERROR("Failed to poll target for gcov data (%d)!", res);
			break;
		}
		/* let registered timer callbacks to run */
		target_call_timer_callbacks();
	}
	return res;
}

int esp_cmd_gcov(struct target *target, const char **argv, int argc)
{
	static struct esp_apptrace_cmd_ctx s_at_cmd_ctx;
	struct esp32_common *esp32 = (struct esp32_common *)target->arch_info;
	int res = ERROR_OK;
	enum target_state old_state = target->state;
	struct esp32_algo_run_data run;
	uint32_t func_addr;
	bool dump = false;

	if (argc > 0) {
		if (strcmp(argv[0], "dump") == 0) {
			dump = true;
		} else {
			LOG_ERROR("Invalid action!");
			return ERROR_FAIL;
		}
	}

	// init cmd context
	res = esp_gcov_cmd_init(target, &s_at_cmd_ctx, argv, argc);
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to init cmd ctx (%d)!", res);
		return res;
	}
	// connect
	res = esp_apptrace_connect_targets(&s_at_cmd_ctx, true, dump);
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to connect to targets (%d)!", res);
		esp_gcov_cmd_cleanup(&s_at_cmd_ctx);
		return res;
	}
	if (dump) {
		esp_gcov_poll(target, &s_at_cmd_ctx);
	} else {
		if (esp32->dbg_stubs.entries_count < ESP32_DBG_STUB_ENTRY_GCOV+1) {
			LOG_ERROR("No GCOV stubs found!");
			return ERROR_FAIL;
		}
		func_addr = esp32->dbg_stubs.entries[ESP32_DBG_STUB_ENTRY_GCOV];
		LOG_DEBUG("GCOV_FUNC = 0x%x", func_addr);
		if (func_addr == 0) {
			LOG_ERROR("GCOV stub not found!");
			return ERROR_FAIL;
		}
		memset(&run, 0, sizeof(run));
		run.stack_size		= 1024;
		run.usr_func_arg	= &s_at_cmd_ctx;
		run.usr_func		= esp_gcov_poll;
		esp32_run_onboard_func(target, &run, func_addr, 0);
		LOG_DEBUG("FUNC RET = 0x%x", run.ret_code);
	}
	// disconnect
	res = esp_apptrace_connect_targets(&s_at_cmd_ctx, false, old_state == TARGET_RUNNING);
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to disconnect targets (%d)!", res);
	}
	res = esp_gcov_cmd_cleanup(&s_at_cmd_ctx);
	if (res != ERROR_OK) {
		LOG_ERROR("Failed to cleanup cmd ctx (%d)!", res);
	}
	return res;
}
